[{"f":"102EF998-5094-482A-B708-9DA64C04C859","t":"Installation Instructions and Usage Notes","c":"To install this package: Download the latest release of the VSIX installer for your version of Visual Studio from the Releases page of the project site. The package can be installed in Visual Studio 2019"},{"f":"141160ac-ba6a-4f6d-a802-1110aadea932","t":"Welcome","c":"Welcome to the Extended XML Documentation Comments Completion Provider project. This project is a Visual Studio editor extension that augments the standard C# XML documentation comments elements with custom"},{"f":"16fd137b-699a-4260-906f-59d94818ff7a","t":"Version 2021.7.5.0","c":"Changes made in this release: Added support for Visual Studio 2022. See Also Other Resources Version History"},{"f":"23ea721a-0a75-48c7-8457-7614bf3c4926","t":"Version 2022.7.29.0","c":"Changes made in this release: Added support for the title attribute and the todo note type for the note XML comments element. See Also Other Resources Version History"},{"f":"34d99bb4-76e2-4f02-b2e4-1feaab4dbba8","t":"Version 2019.10.27.0","c":"Initial release. See Also Other Resources Version History"},{"f":"3BBB6221-417C-4F5C-B89A-563A8052CE35","t":"System Requirements and Building the Code","c":"The master branch is for Visual Studio 2019 and later and is the default branch for all current and future development. In order to build the projects you will need Visual Studio 2019 or later. Folder"},{"f":"6857ece7-59b8-4ad0-86bd-ae7453b97faf","t":"Version 2023.2.12.0","c":"Changes made in this release: Added the self-closing option to the see and seealso elements. See Also Other Resources Version History"},{"f":"b146cb94-e594-4462-9262-d5cdba76c331","t":"Known Issues","c":"The following are some known issues. Completion providers are additive. Each one returns a set of items to add to the completion list based on the current editor context. The providers are unaware of other"},{"f":"C60519F2-A2F7-4EB1-883F-96C51073CEB3","t":"Contributing","c":"Issues Contributing to the Project Coding Style Issues If you don\u0026#39;t feel like working on the code yourself, filing an issue and letting me handle the change is fine. You don\u0026#39;t need to file an issue for"},{"f":"caa20db4-521f-4c4c-8399-aea8a81ae6a7","t":"Version History","c":"This topic describes the various changes made to the Extended XML Documentation Comments Provider over the life of the project. Select a version below to see a description of its changes. Version 2025.9.12.0"},{"f":"f05af659-63c9-439b-8e07-3105f10cfb4a","t":"Version 2025.9.12.0","c":"Changes made in this release: Important As of this release, only Visual Studio 2022 and later are supported. Support for Visual Studio 2019 has been dropped. I do not use the older versions anymore, it"}]