[{"f":"02096c70-c178-44f9-ac9f-f3d479a2b77a","t":"legacyItalic","c":"This element marks italicized text in legacy documents. The schema does not recommend using this element. Instead, use one of the other common inline elements that describe a specific type of item such"},{"f":"02e60906-b8d5-4258-9348-aad70f48861f","t":"command","c":"This element describes the name of an executable or other software application than can be ran. Usage Enter the element in the topic and specify the application name as the inner text. The system element"},{"f":"03a1ba01-868a-432b-afe7-0a9753ae08d1","t":"SDK Technology Orientation","c":"This document type is used for technology orientation topics. SDK Technology Orientation File Format Below is an example of an SDK Technology Orientation topic file. SDK Technology Orientation Topic Copy"},{"f":"075a7b21-73d8-4fe2-a0c1-2289a575fbe7","t":"Version 1.0.0.0","c":"Version 1.0.0.0 was released on June 4th, 2008. Changes in This Release Initial release. See Also Other Resources Version History"},{"f":"0f1bdf10-7968-4e17-aaf9-849091479df8","t":"token","c":"A token is used as a replaceable tag within a topic and is represented using a token element. The inner text of the element is a token name. The tokens are defined in a separate token file. They are an"},{"f":"0ff85a0b-3fed-48dc-87a7-c73d8711ea92","t":"Version 1.1.0.1","c":"Version 1.1.0.1 was released on February 21st, 2011. Changes in This Release Updated the definitionTable , list , and table topics to note that text in the definition , listItem , and entry elements should"},{"f":"161537d9-6f89-42ef-9c51-3a15ef94df65","t":"bibliography/cite","c":"The auto-generated bibliography feature, an extension provided by the presentation styles in the Sandcastle Help File Builder, allows an author to create an external bibliography data XML file and then"},{"f":"18be60b7-88fe-4860-84bf-9a541f1e13c0","t":"Walkthrough","c":"This document type is used for walkthrough topics. Walkthrough File Format Below is an example of a Walkthrough topic file. Walkthrough Topic Copy \u0026lt;?xml version=\u0026quot;1.0\u0026quot; encoding=\u0026quot;utf-8\u0026quot;?\u0026gt; \u0026lt;topic id=\u0026quot;00000000-0000-0000-0000-000000000000\u0026quot;"},{"f":"195da602-cc1a-4545-b6f1-1c2e2cfc59ac","t":"newTerm","c":"This element is used to introduce new terms or technologies. Usage Enter the element in the topic and specify the new term as the inner text. Example Copy Topics to cover include \u0026lt;newTerm\u0026gt;LINQ\u0026lt;/newTerm\u0026gt;,"},{"f":"1a3f0cb3-4ea0-467a-8f53-32daffe3336b","t":"Reference With Syntax","c":"This document type is used for reference with syntax topics. Reference With Syntax File Format Below is an example of a Reference With Syntax topic file. Reference With Syntax Topic Copy \u0026lt;?xml version=\u0026quot;1.0\u0026quot;"},{"f":"1a817894-db7a-4c7f-bd67-cca896affa35","t":"autoOutline Rendered Example","c":"This topic contains the following sections: Section 1 Section 2 See Also The introduction. If \u0026lt;autoOutline /\u0026gt; is included, this paragraph can be omitted. Section 1 This is section 1. Select a sub-section:"},{"f":"1f20a093-5394-460b-8526-822fb327fc2c","t":"unmanagedCodeEntityReference","c":"This element is used to refer to unmanaged code entity references. Unlike managed code entity references, this element does not result in a link to the referenced item. Usage Enter the element in the topic"},{"f":"27f10273-2112-47fd-baf4-5ee90e79fba4","t":"subscript","c":"This element can be used to mark a subscript such as those found in mathematical expressions. Usage Enter the element in the topic and specify the subscript text as the inner text. Example Copy The chemical"},{"f":"28f99529-1e07-4a5e-978f-d2a27c3c7fb1","t":"database","c":"This element is used to describe a database. Usage Enter the element in the topic and specify the database as the inner text. Example Copy The information is stored in the \u0026lt;database\u0026gt;Content\u0026lt;/database\u0026gt;"},{"f":"2ac532de-69cc-45c7-9f78-5d668fcb4339","t":"Version 1.1.0.2","c":"Version 1.1.0.2 was released on April 7th, 2012. Changes in This Release Added a solution file for use in editing the project within Visual Studio with the Sandcastle Help File Builder and updated the"},{"f":"303c996a-2911-4c08-b492-6496c82b3edb","t":"Welcome","c":"Welcome to the Sandcastle MAML Guide. This is intended to be a reference that you can use to find out all that you need to know about Microsoft Assistance Markup Language (MAML) as used with Sandcastle"},{"f":"30797814-3a36-4844-b348-9c97b61c74f2","t":"Conceptual","c":"This document type is used for general conceptual topics. Conceptual File Format Below is an example of a Conceptual topic file. Conceptual Topic Copy \u0026lt;?xml version=\u0026quot;1.0\u0026quot; encoding=\u0026quot;utf-8\u0026quot;?\u0026gt; \u0026lt;topic id=\u0026quot;00000000-0000-0000-0000-000000000000\u0026quot;"},{"f":"34c8823f-8395-4d64-9941-8d156083709c","t":"mediaLink","c":"This element is used to insert an image within a conceptual topic. This is a block element and the image appears by itself out of line. Usage To use a media link, insert the element within the topic at"},{"f":"3698dacb-763b-4a45-a051-f34c09e5f862","t":"section","c":"This element is used to create a section within a topic. Usage Enter the element in the topic with a nested content element that contains the section\u0026#39;s content. An optional title element can be used to"},{"f":"382fc569-33e4-489a-b0c2-94c11e56ab4a","t":"replaceable","c":"This element describes a part of a command or a function that must be replaced by the user. Usage Enter the element in the topic and specify the replaceable item as the inner text. Example Copy \u0026lt;command\u0026gt;COPY"},{"f":"3913b321-c875-4bb9-88de-4c65f6363270","t":"Media Content File","c":"The media (images) used by conceptual content in a help file project are defined in a separate media content file. Each is assigned a unique ID that is used to refer to the image in conceptual topic links."},{"f":"3be5c58d-d6af-45a4-ac51-f219a75c4c4d","t":"Link Elements","c":"The topics in this section define the link elements that can be used in conceptual topics. Link Elements Select one of the topics below to learn more about a particular link element. codeEntityReference"},{"f":"3d6cb7db-3633-4517-8ace-db72c2607a80","t":"Version 2017.5.15.0","c":"Release notes for version 2017.5.15.0. Changes in This Release Added a lineBreak element topic. Revised the topic on how to install the MAML schemas so that it shows how to use the help file builder copies"},{"f":"3fad0c13-9dcb-471e-890b-228acf54b574","t":"fictitiousUri","c":"This element describes a fictitious internet address such as a web or email address. Usage Enter the element in the topic and specify the fictitious URI as the inner text. Example Copy The e-mail address"},{"f":"448a32c2-9922-4901-8d23-37cb0b253d9a","t":"languageKeyword","c":"This element is used to specify a language keyword. Unlike codeInline , the keyword is connected to the language filter in the topic if the presentation styles supports it and the keyword text will change"},{"f":"47e7184b-4213-44b2-9602-a0271d93747b","t":"hardware","c":"This element describes a physical part of a computer system. Usage Enter the element in the topic and specify the hardware as the inner text. Example Copy Plug the \u0026lt;hardware\u0026gt;flash drive\u0026lt;/hardware\u0026gt; into"},{"f":"48314339-e0fe-4d1a-96b0-eba5eca70b66","t":"medialLinkInline","c":"This element is used to insert an image inline within the text of a conceptual topic. Usage To use an inline media link, insert the element within the text of the topic at the location that the image should"},{"f":"4cf23985-a97b-46d4-8624-a46b77cca86b","t":"errorInline","c":"This element describes an error or error message. Usage Enter the element in the topic and specify the error as the inner text. Example Copy If a file does not exist, a \u0026lt;errorInline\u0026gt;File Not Found\u0026lt;/errorInline\u0026gt;"},{"f":"525076e5-f27d-4df7-9447-a68558a740df","t":"Reference","c":"This document type is used for reference topics. Reference File Format Below is an example of a Reference topic file. Reference Topic Copy \u0026lt;?xml version=\u0026quot;1.0\u0026quot; encoding=\u0026quot;utf-8\u0026quot;?\u0026gt; \u0026lt;topic id=\u0026quot;00000000-0000-0000-0000-000000000000\u0026quot;"},{"f":"5389dce5-e592-4ae2-9b35-071627542f07","t":"foreignPhrase","c":"This element is used to describe a phrase that is of a language that is different than the primary language of the document. Usage Enter the element in the topic and specify the phrase as the inner text."},{"f":"53a2b7c6-a269-4916-9313-bdc301ee9398","t":"link","c":"This is used to insert a link to another conceptual topic using its ID value. It can also be used to create links to elements within the same page that have an address attribute such as the introduction"},{"f":"53e9f04f-fbc4-480d-9653-1547046526f1","t":"Schema Extensibility","c":"This topic will explain how you can change the MAML schema so that you can use elements from other namespaces as well. This is useful when extending Sandcastle with build components that provide new elements"},{"f":"5bab8ccb-0ff0-496e-aa15-ae803c210a22","t":"math","c":"This element can be used to mark mathematical expressions. Usage Enter the element in the topic and specify the mathematical expression as the inner text. Example Copy A simple math expression: \u0026lt;math\u0026gt;1"},{"f":"65e7e30a-ba03-4e10-b1f2-763a613b6e27","t":"code","c":"This element can be used to display a multi-line code fragment in a conceptual topic. For single lines or keywords, you can use the codeInline element. Usage Literal XML And Other Special Characters Attributes"},{"f":"66bf98c7-7179-4940-8767-7085052f2f53","t":"Glossary","c":"A | B | C | D | E | F | G | H | I | J | K | L | M | N | O | P | Q | R | S | T | U | V | W | X | Y | Z B BuildAssembler.exe This is a tool supplied with Sandcastle that is used to build the help topics"},{"f":"6a9e1e0c-4e15-43e0-af9f-8ac9c1ab3b0c","t":"superscript","c":"This element can be used to mark a superscript such as those found in mathematical expressions. Usage Enter the element in the topic and specify the superscript text as the inner text. Example Copy Can"},{"f":"6c6f1e3b-2b3c-4157-8cf0-ba5498c8a898","t":"Reference Without Syntax","c":"This document type is used for reference without syntax topics. Reference Without Syntax File Format Below is an example of a Reference Without Syntax topic file. Reference Without Syntax Topic Copy \u0026lt;?xml"},{"f":"71cf59a5-a37e-49cb-9e8b-adec66f2de7d","t":"SDK Technology Scenarios","c":"This document type is used for technology scenario topics. SDK Technology Scenarios File Format Below is an example of an SDK Technology Scenarios topic file. SDK Technology Scenarios Topic Copy \u0026lt;?xml"},{"f":"746fc19e-2670-440b-8277-a1ef7dc074d5","t":"Visual Studio IntelliSense","c":"This topic covers how to manually integrate MAML schema files into Visual Studio\u0026#39;s global schema cache to provide IntelliSense when editing MAML topics within Visual Studio. Tip The Sandcastle Help File"},{"f":"77a994ec-637c-43c5-8bea-981eb5fd23af","t":"para","c":"This element can be used to create paragraphs in conceptual content. Usage Enter the element in the topic and specify the paragraph text as the inner text. Making the element self-closing or empty will"},{"f":"7a5600cb-9a9f-416e-b575-446c1b5a432c","t":"SDK Technology Code Directory","c":"This document type is used for UI reference topics. SDK Technology Code Directory File Format Below is an example of an SDK Technology Code Directory topic file. SDK Technology Code Directory Topic Copy"},{"f":"847c2d90-c877-4369-a3ab-f7373b6547df","t":"Making a Donation","c":"If you would like to support this project, you can make a donation of any amount you like by clicking on the PayPal donation button below. Another option is to click the Sponsor button in the page footer"},{"f":"86752a38-eba3-4174-bcbf-79ec8428ecf9","t":"Conceptual Content File Types","c":"The topics in this section define the various file types used to produce conceptual content help files. If you are using a tool such as the Sandcastle Help File Builder , only the topic file information"},{"f":"8b05e77d-04d1-4b60-9d9f-4de4817aa3a9","t":"ui","c":"This element describes a user interface element. Usage Enter the element in the topic and specify the user interface item as the inner text. Example Copy Click the \u0026lt;ui\u0026gt;OK\u0026lt;/ui\u0026gt; button to close the dialog"},{"f":"8bf3513b-adb9-4f98-ad0f-1de21042488d","t":"Error Message","c":"This document type is used for error message topics. Error Message File Format Below is an example of an Error Message topic file. Error Message Topic Copy \u0026lt;?xml version=\u0026quot;1.0\u0026quot; encoding=\u0026quot;utf-8\u0026quot;?\u0026gt; \u0026lt;topic"},{"f":"915392b7-c701-44fd-8ff4-89c34a10f574","t":"codeInline","c":"This element describes a string of code or a single keyword. For multi-line code fragments, use the code element instead. Usage Enter the element in the topic and specify the code as the inner text. Example"},{"f":"91a45341-e368-463e-a9ed-9e05286d2c25","t":"codeReference","c":"A codeReference element is used to insert a commonly used code snippet into a conceptual topic. The code snippets are stored in an external file . Note When using the Sandcastle Help File Builder or the"},{"f":"96efe90a-65d4-49b2-81de-a8f05560cd60","t":"quote","c":"This element describes a quotation. Usage Enter the element in the topic and specify the quotation as the inner text. Example Copy \u0026lt;para\u0026gt;To quote the schema:\u0026lt;/para\u0026gt; \u0026lt;quote\u0026gt;The quote element describes a"},{"f":"97724282-5470-48ca-89c6-541737fafd1f","t":"introduction","c":"This element contains an introduction to some part of the document. Most conceptual document types have a required introduction section. Usage Enter the element in the topic and specify the text to use"},{"f":"9b994e89-b582-4224-bad9-2cddfafbec68","t":"How-To","c":"This document type is used for \u0026quot;how to\u0026quot; topics. How-To File Format Below is an example of a How-To topic file. How-To Topic Copy \u0026lt;?xml version=\u0026quot;1.0\u0026quot; encoding=\u0026quot;utf-8\u0026quot;?\u0026gt; \u0026lt;topic id=\u0026quot;00000000-0000-0000-0000-000000000000\u0026quot;"},{"f":"9bef5420-7560-47d9-98ce-0b5d5f46567a","t":"Code Snippets File","c":"The code snippets file allows you to define code samples outside of conceptual topic files. Each snippet has a unique ID that can be referenced in multiple topics using a codeReference MAML element so"},{"f":"9d0dc122-7829-4b22-af2e-6685867116f8","t":"Miscellaneous Elements","c":"The topics in this section define miscellaneous elements not fitting one of the other categories that can be used in conceptual topics. Miscellaneous Elements Select one of the topics below to learn more"},{"f":"a0424e7f-823c-449c-a2e4-012c1f556674","t":"environmentVariable","c":"This element describes an environment variable in an operating system. Usage Enter the element in the topic and specify the environment variable as the inner text. Example Copy The Sandcastle tools find"},{"f":"a55e614a-dc90-440b-aae1-b3f5b2b0104f","t":"SDK Technology Architecture","c":"This document type is used for technology architecture topics. SDK Technology Architecture File Format Below is an example of an SDK Technology Architecture topic file. SDK Technology Architecture Topic"},{"f":"a7e182e0-8881-41d1-a450-31d439250203","t":"Token File","c":"A token is used as a replaceable tag within a topic and is represented using a token element. The inner text of the element is a token name. The tokens are defined in a separate token file. They are an"},{"f":"a8792cd2-e8a1-4e37-bd16-eea84ac463b1","t":"alert","c":"This element can be used to create a note-like section within a conceptual topic to draw attention to some important information. Usage Enter the element in the topic and specify the type of alert using"},{"f":"aa8250ea-dfe4-46c0-b2eb-b4e975f0db1e","t":"License Agreement","c":"This license governs use of the accompanying software. If you use the software, you accept this license. If you do not accept the license, do not use the software. Microsoft Public License (Ms-PL) Definitions"},{"f":"aaaff238-1ab4-4c9e-95d8-60ca4d8d4f8e","t":"markup","c":"This element can be used to pass a literal piece of format-specific markup through to the rendered topic. In general, this element is only used by custom build components to pass markup through after modifying"},{"f":"ad896389-cb62-4a98-bb27-4047e201ab02","t":"Sample","c":"This document type is used for sample topics. Sample File Format Below is an example of a Sample topic file. Sample Topic Copy \u0026lt;?xml version=\u0026quot;1.0\u0026quot; encoding=\u0026quot;utf-8\u0026quot;?\u0026gt; \u0026lt;topic id=\u0026quot;00000000-0000-0000-0000-000000000000\u0026quot;"},{"f":"b00070c7-9c5e-4b49-ad5c-f55fa866f062","t":"Known Issues and Bugs","c":"This topic covers known issues with Sandcastle and conceptual content support in the presentation styles. There is no support for several of the Whitepaper topic elements. Support can be added if needed"},{"f":"b32a73b8-fc26-4c98-912c-d595fc1a17c2","t":"Block Elements","c":"The topics in this section define the block elements that can be used in conceptual topics. Block Elements Select one of the topics below to learn more about a particular block element. alert bibliography/cite"},{"f":"b433ede9-8813-4020-b5dd-74b3204ebe0c","t":"computerOutputInline","c":"This element describes output from either a console prompt or from a UI form. Usage Enter the element in the topic and specify the output as the inner text. Example Copy The result of running \u0026lt;application\u0026gt;HelloWorld.exe\u0026lt;/application\u0026gt;"},{"f":"b5d4c819-b4cc-443e-916e-cb8e5a655d0e","t":"Glossary","c":"This document type is used to create a glossary. Glossary File Format Below is an example of a Glossary topic file. Glossary Topic Copy \u0026lt;?xml version=\u0026quot;1.0\u0026quot; encoding=\u0026quot;utf-8\u0026quot;?\u0026gt; \u0026lt;topic id=\u0026quot;00000000-0000-0000-0000-000000000000\u0026quot;"},{"f":"b96d95c0-ec3c-4846-998a-4b43548bfa0e","t":"Common Inline Elements","c":"The topics in this section define the common inline elements that can be used in conceptual topics. Common Inline Elements Select one of the topics below to learn more about a particular inline element."},{"f":"b9a1daac-a2d8-41b7-83b0-b7dc7b28b898","t":"autoOutline","c":"The autoOutline element is a special case used by Sandcastle to insert an auto-generated section outline within a topic\u0026#39;s introduction or sub-sections. Usage Place the element within a topic\u0026#39;s introduction"},{"f":"ba47a67c-4825-4fcd-b806-2b2e02d4373a","t":"Version History","c":"The topics in this section describe the various changes made to the MAML Guide over the life of the project. Version History Select a version below to see a description of its changes. Version 2022.4.16.0"},{"f":"ba6a58eb-3301-4397-8ac5-d174d6dff755","t":"Media Elements","c":"The topics in this section define the media (image) elements that can be used in conceptual topics. Media Elements Select one of the topics below to learn more about a particular media element. mediaLink"},{"f":"bc490dbf-7d46-432d-a816-3ae16ab6af54","t":"codeEntityReference","c":"This is used to insert a reference to a code entity such as a type, method, property, event, field, etc. It can be a reference to a member in one of your classes or one in the .NET Framework. Usage To"},{"f":"bea57722-4254-47b3-a86c-415af363eb2f","t":"Version 1.1.0.3","c":"Version 1.1.0.3 was released on December 16th, 2012. Changes in This Release Removed references to the Sandcastle Help File Builder components and features that have been moved into the Sandcastle tools"},{"f":"bf552a94-f8b9-460d-bf76-a869430a077e","t":"application","c":"This element is used to describe the name of an application such as Microsoft Windows or Notepad. Usage Enter the element in the topic and specify the application name as the inner text. Example Copy Use"},{"f":"bfdd5115-f594-480d-9e79-af906e599337","t":"relatedTopics","c":"This element is used to define a list of links to other topics that may be of interest to the reader. Usage Enter the element in the topic and specify one or more local links, external links, or code entity"},{"f":"c221bd00-b9c7-4e49-b7f5-b4f8934f3208","t":"SDK Technology Summary","c":"This document type is used for technology summary topics. SDK Technology Summary File Format Below is an example of an SDK Technology Summary topic file. SDK Technology Summary Topic Copy \u0026lt;?xml version=\u0026quot;1.0\u0026quot;"},{"f":"c366af27-ac55-44e6-9c62-86cabf3eba77","t":"quoteInline","c":"This element is used to describe an inline quotation. Usage Enter the element in the topic and specify the quotation as the inner text. Example Copy This is an example of an \u0026lt;quoteInline\u0026gt;inline quotation\u0026lt;/quoteInline\u0026gt;."},{"f":"c69a248a-bd94-47b2-90d7-5442e9cb567a","t":"Topic File","c":"The topic file is used to contain a single conceptual topic. Instead of HTML, conceptual content topics use Microsoft Assistance Markup Language (MAML). This is basically XML conforming to a well defined"},{"f":"ca1eccd2-dfa4-4daa-a69b-3bad7e0c4946","t":"legacyBold","c":"This element marks bold text in legacy documents. The schema does not recommend using this element. Instead, use one of the other common inline elements that describe a specific type of item such as application"},{"f":"cb59e91c-f3cd-4086-a7ea-e2413a626e3d","t":"definitionTable, definedTerm, definition","c":"This element describes a list of terms and their definitions. Technically, the MAML schema defines the definition table as a two-column table without a header or footer. However, Sandcastle renders the"},{"f":"cfd9dabf-22f3-4742-8b54-d84404610db1","t":"Companion File","c":"A companion file is used during the build process to obtain the topic title and link text for a particular conceptual topic. There will be one companion file for each conceptual content topic. Note If"},{"f":"d0c9ce6d-115b-4c70-891c-69b4af944dea","t":"externalLink","c":"This is used to insert a link to an external URL of some sort such as a website. Usage An external link consists of the following nested elements. Name Description linkText This is a required element and"},{"f":"d50f98be-cddf-4756-994d-c05431f013a8","t":"literal","c":"This element describes a literal value. Usage Enter the element in the topic and specify the literal value as the inner text. Example Copy If the property is not used, set it to the string \u0026lt;literal\u0026gt;None\u0026lt;/literal\u0026gt;."},{"f":"d6c82cde-f889-4ac9-b3a7-7d45fd6fbffc","t":"list, listItem","c":"This element describes content that should be displayed as a list. Usage Enter the element in the topic and specify the type of list using the class attribute. The content of the list element is one or"},{"f":"d8c4bffb-c6b8-4357-9aa3-7d14320d7848","t":"User Interface Reference","c":"This document type is used for user interface reference topics. User Interface Reference File Format Below is an example of a User Interface Reference topic file. User Interface Reference Topic Copy \u0026lt;?xml"},{"f":"d97b482f-155a-443c-b33c-7395ea06012b","t":"Orientation","c":"This document type is used for orientation topics. Orientation File Format Below is an example of an Orientation topic file. Orientation Topic Copy \u0026lt;?xml version=\u0026quot;1.0\u0026quot; encoding=\u0026quot;utf-8\u0026quot;?\u0026gt; \u0026lt;topic id=\u0026quot;00000000-0000-0000-0000-000000000000\u0026quot;"},{"f":"d995d093-ce18-4a7e-bd03-82c6c0b4fd72","t":"placeholder","c":"This element is used as a placeholder. By default, it renders text in a style determined by the presentation style. It may have specific use in custom build components. Usage Enter the element in the topic."},{"f":"da613e19-4d41-4e92-830e-0c776f14e751","t":"lineBreak","c":"This element inserts a line break within a body of text without creating a new paragraph. Usage Enter the element within a paragraph element where you want the line break to occur. Example Copy \u0026lt;para\u0026gt;This"},{"f":"dc4fcc96-283e-4202-9ecc-08a65e0c9313","t":"Links to Resources","c":"This topics contains links to various resources that you may find useful. MAML Information and Guides Discussion Groups, Blogs, Etc. Additional Tools MAML Information and Guides The most recent version"},{"f":"e411f3f8-e3ec-4617-8ecd-0046e2e9df85","t":"XML Reference","c":"This document type is used for XML reference topics. XML Reference File Format Below is an example of an XML Reference topic file. XML Reference Topic Copy \u0026lt;?xml version=\u0026quot;1.0\u0026quot; encoding=\u0026quot;utf-8\u0026quot;?\u0026gt; \u0026lt;topic"},{"f":"e5d750b6-6bd9-4263-98f2-a3d5d5c268d8","t":"Whitepaper","c":"This document type is used for whitepapers. Whitepaper File Format Below is an example of a Whitepaper topic file. Whitepaper Topic Copy \u0026lt;?xml version=\u0026quot;1.0\u0026quot; encoding=\u0026quot;utf-8\u0026quot;?\u0026gt; \u0026lt;topic id=\u0026quot;00000000-0000-0000-0000-000000000000\u0026quot;"},{"f":"e5f49add-f931-4a46-9958-f50eda227479","t":"Version 1.1.0.0","c":"Version 1.1.0.0 was released on October 25th, 2008. Changes in This Release Corrected the order of the linkAlternateText and linkUri elements in the externalLink topic and all uses of it throughout the"},{"f":"e87ebaad-7085-410b-a445-09c456e94c07","t":"Troubleshooting","c":"This document type is used for troubleshooting topics. Troubleshooting File Format Below is an example of a Troubleshooting topic file. Troubleshooting Topic Copy \u0026lt;?xml version=\u0026quot;1.0\u0026quot; encoding=\u0026quot;utf-8\u0026quot;?\u0026gt;"},{"f":"e90091a9-3959-4718-b109-ea8e75837e62","t":"legacyUnderline","c":"This element marks underlined text in legacy documents. The schema does not recommend using this element. Instead, use one of the other common inline elements that describe a specific type of item such"},{"f":"e9ecadad-9cc3-4089-9a91-ef93b3f9400e","t":"userInput","c":"This element describes data that is entered by the user. Usage Enter the element in the topic and specify the input as the inner text. Example Copy Enter \u0026lt;userInput\u0026gt;Yes\u0026lt;/userInput\u0026gt; or \u0026lt;userInput\u0026gt;No\u0026lt;/userInput\u0026gt;."},{"f":"ec11472a-8a9c-44e7-9d32-45f671526922","t":"table, tableHeader, row, entry","c":"This element is used to arrange data in a table format with rows and columns. An optional title and table header can also be included. Usage A table consists of the following elements: table This is the"},{"f":"ecd8ab10-57b5-4094-b195-4c8c5a1ba3d0","t":"localUri","c":"This element describes the path to a local resource such as a file. Usage Enter the element in the topic and specify the path as the inner text. Example Copy The Sandcastle Help File Builder is installed"},{"f":"ee982f89-b3b7-4863-aded-01a5ff4634fa","t":"Version 2022.4.16.0","c":"Release notes for version 2022.4.16.0. Changes in This Release Made various general revisions to reflect how the MAML elements are currently used. Added a topic for the bibliography/cite elements. Added"},{"f":"f1a0543f-d583-47a7-ac92-5b998326913e","t":"system","c":"This element describes system commands, command line switches, etc. Usage Enter the element in the topic and specify the command or switches as the inner text. Example Copy \u0026lt;command\u0026gt;COPY \u0026lt;system\u0026gt;/s /e\u0026lt;/system\u0026gt;\u0026amp;#160;\u0026lt;replaceable\u0026gt;sourceFileSpec\u0026lt;/replaceable\u0026gt;"},{"f":"fead6b84-f844-4669-abd2-26667cd7be6e","t":"phrase","c":"This element is a wrapper element for a run of text. It is solely a container and does not specify any semantics on its own. Usage Enter the element in the topic and specify the phrase as the inner text."}]