[{"f":"027d2fbc-7bfb-4dc3-b4f5-85f95fcf7629","t":"Welcome","c":"Welcome to the Spell Checker My Code project. This project is a Visual Studio editor extension that checks the spelling of comments, strings, and plain text as you type or interactively with a tool window."},{"f":"0374de80-9512-4b10-928f-ec3ba6caf018","t":"Version 2023.5.8.0","c":"This release contains some significant changes: All of the configuration settings have been moved from the old .vsspell XML configuration files to .editorconfig settings. This will require conversion of"},{"f":"038546c7-5546-9c41-9a17-37de82268862","t":"ISpellingService.IsEnabled Method","c":"ISpelling Service Is Enabled Method This is used to see if spell checking is enabled for the given text buffer Definition Namespace: VisualStudio.SpellChecker.Definitions Assembly: VisualStudio.SpellChecker.Definitions"},{"f":"04d6f71e-e4c3-41c2-b46e-fd0da1239843","t":"Version 2020.8.24.0","c":"Changes in this release: Adjusted the classifier definitions so that \u0026quot; /** */ \u0026quot; comments are not treated like XML documentation comments in script languages such as TypeScript which uses them for markdown"},{"f":"09cc5bfa-9eba-47e5-ba5f-a36e04f09b0d","t":"Code Analyzer Options","c":"This category contains several options that let you fine tune how source code files are spell checked. The following options are available. The following options only apply to the code analyzer used to"},{"f":"0c3c3096-f988-8209-504b-fab1cd86586a","t":"ISpellingService Methods","c":"ISpelling Service Methods Methods IsEnabled This is used to see if spell checking is enabled for the given text buffer See Also Reference ISpellingService Interface VisualStudio.SpellChecker.Definitions"},{"f":"0e32d501-0391-44ef-aaad-51c45c072ca1","t":"Version 2017.12.29.0","c":"Changes in this release: Fixed handling of Unicode apostrophes when removing \u0026quot;\u0026#39;s\u0026quot; to spell check the word without it. Added support for spell checking comments after an #endregion directive. Updated the"},{"f":"0ff35371-69b5-48dd-a062-037abe2469de","t":"Defining Solution/Project Spell Check Classifiers","c":"Unlike spell check as you type and the active document spell checking tool window, the solution/project spell checking tool window must classify the content of each and every file for itself to determine"},{"f":"1207ac2b-6fac-5f44-9e42-958d8a0e444e","t":"ISpellingIssue.Suggestions Property","c":"ISpelling Issue Suggestions Property This read-only property is used to get suggestions that can be used to replace the misspelled word Definition Namespace: VisualStudio.SpellChecker.Definitions Assembly:"},{"f":"12d44ba0-2bef-4fac-a6f9-7990ecf057c2","t":"Code Analyzer Rules","c":"The code analyzer in the spell checker extension is used to spell check identifiers in source code. Only C# is supported right now but future support for Visual Basic and, if possible, F# are planned."},{"f":"15873823-4d56-486e-9069-836d44e96c75","t":"Version 2014.6.14.0","c":"Changes in this release: Fixed the tool window so that it does not throw a \u0026quot;key not found\u0026quot; exception when the \u0026quot;Spell check as you type\u0026quot; option is disabled. Fixed a bug in the C# tagger related to multi-line"},{"f":"1c0d6f51-f08f-4a6f-9f5b-3ff231533b91","t":"Version 1.0.0.0","c":"Version 1.0.0.0 was released on June 8th, 2013. Initial release. See Also Other Resources Version History"},{"f":"2564098b-6121-5a7d-5657-8367427a5a64","t":"ISpellingSuggestion.Culture Property","c":"ISpelling Suggestion Culture Property This read-only property returns the culture information for the suggestion Definition Namespace: VisualStudio.SpellChecker.Definitions Assembly: VisualStudio.SpellChecker.Definitions"},{"f":"3094ee74-88ae-4355-b702-23dcd55b4197","t":"Using the Ignore Spelling Directive","c":"Often, there are a some words in each project that are used in one or more files that are flagged as misspellings such as names, abbreviations, or programming terms. While these can be added to a configuration"},{"f":"34a83757-5ee9-cc52-e0f1-0529ee51d46c","t":"ISpellingIssue.MisspellingType Property","c":"ISpelling Issue Misspelling Type Property This read-only property returns the misspelling type Definition Namespace: VisualStudio.SpellChecker.Definitions Assembly: VisualStudio.SpellChecker.Definitions"},{"f":"36e07fde-3038-e734-c94f-f4ceaf9c8a72","t":"MisspellingType Enumeration","c":"Misspelling Type Enumeration This enumerated type defines the misspelling types Definition Namespace: VisualStudio.SpellChecker.Definitions Assembly: VisualStudio.SpellChecker.Definitions (in VisualStudio.SpellChecker.Definitions.dll)"},{"f":"3f7ff8cc-5493-4f6d-a1f4-99f9e245f621","t":"Version 2016.5.28.0","c":"Changes in this release: Added support and configuration options for spell checking any WPF text box within Visual Studio. See the Visual Studio WPF Text Boxes topic for usage notes and for known issues"},{"f":"4678c253-8ef1-48be-81f7-0a551756b374","t":"ISpellingIssue.Word Property","c":"ISpelling Issue Word Property This read-only property returns the misspelled or doubled word Definition Namespace: VisualStudio.SpellChecker.Definitions Assembly: VisualStudio.SpellChecker.Definitions"},{"f":"508e7e8f-e00f-43f1-ad4c-5439ddec84b8","t":"Adding Custom Dictionaries","c":"The package uses Hunspell to perform spell checking and comes with several dictionaries for various languages. Since Hunspell makes use of Open Office dictionaries, you can download additional dictionaries"},{"f":"53ffc5b7-b7dc-4f03-9a51-ed4176bff504","t":"Active Document Spell Check Tool Window","c":"Selecting Tools | Spell Checker | Spell Check Current Document opens the active document spell checker tool window. This tool window will only be usable when a code or text editor window is selected as"},{"f":"548dc6d7-6d08-4006-82b3-d5830be96f04","t":"Version History","c":"This topic describes the various changes made to the Spell Check My Code extension over the life of the project. Select a version below to see a description of its changes. Version 2025.12.12.0 Version"},{"f":"5c8fdba1-adda-4aeb-9dc0-d5fb696c38c6","t":"Version 2018.8.3.0","c":"Changes in this release: Added support for compiler generated code behind files like those for inline code in Razor .cshtml files. Fixed handling of Unicode SQL strings ( Select X = N\u0026#39;Unicode string literal\u0026#39;"},{"f":"6216eedb-6434-4cad-be06-576814e0b735","t":"Exclusion Expressions","c":"This category lets you define regular expressions that are used to exclude spans of text from the spell checking process. This is useful for excluding things such as common format specifier patterns in"},{"f":"63d5096c-6695-441d-886a-01a120f2894a","t":"Binding Spell Checker Options to Shortcut Keys","c":"The spell checker package does not assign shortcut keys to the options on the Tools | Spell Checker submenu. This avoids conflicts with built-in Visual Studio commands and other packages. However, you"},{"f":"67af1ab3-1e2b-43ee-81a0-588b0cb0d336","t":"Version 2018.8.25.0","c":"Changes in this release: Fixed obtaining text from open editors in the solution/project spell checks so that it works for document editors that implement IVsTextBufferProvider rather than IVsTextLines"},{"f":"6a987caf-5ad9-4dab-a17c-c887881fec7a","t":"Ignored Classifications","c":"This category lets you exclude specific classifications of text from being spell checked by content/file type. This is more generic than the C#/C-Style language category options and can be applied to any"},{"f":"6c7012c2-63ee-41d4-8036-df1054b0b714","t":"Version 2023.5.15.0","c":"Changes made in this release: Fixed incorrect path resolution for additional dictionary folders and the global ignored words file. Set the ignore private identifiers, internal identifiers, compiler generated"},{"f":"6e367971-5be2-4b3b-b1db-65262e1841a0","t":"Version 2024.12.14.0","c":"Changes made in this release: An updated was required due to a change in the Visual Studio SDK that forced the spell checker assemblies to be marked as not CLS compliant. Also, when running out of process,"},{"f":"6f36563a-31c5-ae5b-30e2-3dda3df4d1f2","t":"INaturalTextTag Interface","c":"INatural Text Tag Interface This represents a tag for natural text regions Definition Namespace: VisualStudio.SpellChecker.Definitions Assembly: VisualStudio.SpellChecker.Definitions (in VisualStudio.SpellChecker.Definitions.dll)"},{"f":"70695fc7-f468-4a3d-a46b-3658d373670a","t":"Version 1.0.0.0 to 2021.3.1.0","c":"The topics in this section describe the various changes made to the spell checker for versions 1.0.0.0 through 2021.3.1.0. Select a version below to see a description of its changes. Version 2021.3.1.0"},{"f":"74c10bfa-832e-4f2a-bd70-1463c98c6f65","t":"Version 2015.3.1.0","c":"Changes in this release: Fixed some theme and font size issues. Fixed the C# tagger so that it does not include the region keyword when spell checking the subsequent region description. When using the"},{"f":"78bc11b2-d96b-af29-6819-63f07697c85f","t":"ISpellingSuggestion.Suggestion Property","c":"ISpelling Suggestion Suggestion Property This read-only property returns the suggested replacement word Definition Namespace: VisualStudio.SpellChecker.Definitions Assembly: VisualStudio.SpellChecker.Definitions"},{"f":"791803a7-37d8-40a9-beba-bac4f0a74279","t":"Version 2019.7.8.0","c":"Changes in this release: Fixed a crash in C\u002B\u002B files when entering an #include statement. See Also Other Resources Version History"},{"f":"797db4ab-e0e3-0847-5944-353fce7448c6","t":"ISpellingSuggestion Interface","c":"ISpelling Suggestion Interface This represents a spelling suggestion that can be used to replace a misspelled word Definition Namespace: VisualStudio.SpellChecker.Definitions Assembly: VisualStudio.SpellChecker.Definitions"},{"f":"7be3a6a1-c374-4384-9b5b-5dc1b01d4307","t":"Version 2025.9.10.0","c":"Changes made in this release: After 12 years, Microsoft decided that they don\u0026#39;t like me using \u0026quot;Visual Studio\u0026quot; in the title of the extension and sent me a DMCA notice. As such, I have had to change the"},{"f":"843b1166-b105-8d83-2699-b089b0cdbb20","t":"ISpellingIssue Properties","c":"ISpelling Issue Properties Properties MisspellingType This read-only property returns the misspelling type Suggestions This read-only property is used to get suggestions that can be used to replace the"},{"f":"847a2b53-6583-4198-80ef-0e537346e4a3","t":"Contributing","c":"Issues Contributing to the Project Coding Style Issues If you don\u0026#39;t feel like working on the code yourself, filing an issue and letting me handle the change is fine. You don\u0026#39;t need to file an issue for"},{"f":"849b4568-2e2c-47a0-8a13-cb2b7640314b","t":"Version 2016.7.28.0","c":"Changes in this release: Added \\U201E (double low-9 quotation mark) as a work break character. Added support for spell checking markdown files within the Visual Studio text editor when using the Markdown"},{"f":"875213fe-3e53-4bf3-acdc-7654d0c7756d","t":"Version 2018.10.27.0","c":"Important As of this release, the VS2017 and Later version of the package requires at least Visual Studio 2017 version 15.5 in order to install the package. Changes in this release: Fixed a bug with suggestions"},{"f":"904f5ad1-18d3-4615-ba34-9f9259f11776","t":"Version 2019.5.5.0","c":"Changes in this release: If no suggestions are found in the WPF text box spell checker, the Add to Dictionary and Ignore Word options are now shown. Fixed the spell checker configuration editor and tool"},{"f":"94c633b4-5924-4a67-8e82-a0e731d6daaa","t":"Version 2023.3.4.0","c":"Changes in this release: Prevented the package from setting the Hunspell native DLL path if it has already been set by another package such as Resharper which also uses NHunspell. This prevents odd behavior"},{"f":"9581715a-a5bc-4de5-9474-eaefa38cf211","t":"Spell Checking Options","c":"The left side of the tool window contains the following items that control the process and display the results. Spell Check - This combo box lets you choose what is spell checked. The first option is always"},{"f":"96330520-5052-407a-969e-0fc07ad61c7d","t":"Version 2024.6.17.0","c":"Changes made in this release: Updated the tagger providers to use view taggers to support languages such as Visual Basic that changed in Visual Studio 2022 (17.9.1) that now only classify the view and"},{"f":"976e62f3-eb2d-44a2-79c3-558adf92366d","t":"ISpellingIssue Interface","c":"ISpelling Issue Interface This represents a spelling issue such as a misspelled word, doubled word, etc. Definition Namespace: VisualStudio.SpellChecker.Definitions Assembly: VisualStudio.SpellChecker.Definitions"},{"f":"9b0ee624-54c6-4020-b546-03e6f5c96b0e","t":"Version 2023.12.29.0","c":"Changes made in this release: Moved generation of suggestions for code analyzer misspellings to the code fix provider which should reduce excessive CPU usage by the code analyzer. Fixed an issue with the"},{"f":"9e9ebccd-3b61-4890-8467-823dacc7af3f","t":"Version 2020.6.11.0","c":"Changes in this release: Ensured that at least the default global ignored words file is included in the global configuration when there is no saved configuration file. Fixed a crash in the solution/project"},{"f":"9fb1c75e-f99c-bc2a-0401-a2643322866b","t":"ISpellingSuggestion Properties","c":"ISpelling Suggestion Properties Properties Culture This read-only property returns the culture information for the suggestion Suggestion This read-only property returns the suggested replacement word See"},{"f":"a3eaed0f-fcf3-4df8-8889-7073395601a5","t":"Version 2015.11.8.0","c":"Changes in this release: Fixed the solution/project spell checking tool window so that it correctly handles projects nested within solution item folders. Thanks to Bart Koelman for supplying the suggested"},{"f":"a7120f4c-5191-4442-b366-c3e792060569","t":"VSSpell001: Correct spelling of \u0026#39;XXX\u0026#39;","c":"Item Value Rule ID VSSpell001 Category Naming Fix is breaking or non-breaking Correcting the spelling in the identifier of a namespace or a public or protected type or member is considered a breaking change."},{"f":"a81683de-f3ea-4698-847a-d87c3f1e8477","t":"Version 2016.3.12.0","c":"Changes in this release: Improved the performance of configuration file generation for editor spell checkers by only searching the current solution if the potential configuration file actually exists on"},{"f":"a9ff4ce1-0d6b-4376-8d32-02dae64e2075","t":"Known Issues and Limitations","c":"The following are some known issues and workarounds and some limitations with the spell checker. Code Analyzers The code analyzers only apply to identifiers in supported languages. Identifier misspellings"},{"f":"af34b863-6a1c-41ed-bcf2-48a714686519","t":"Dictionary Settings","c":"This category lets you configure the dictionary settings. Additional Dictionary Folders Language(s) Determine Localized Resource File Language from the Filename User Dictionary Additional Dictionary Folders"},{"f":"b156d5ad-347f-4f63-89dc-4f945953ae41","t":"Import Settings","c":"This category lets you specify another spell checker configuration file from which settings will be imported when the containing configuration file is loaded for use. This allows you to import settings"},{"f":"b4a8726f-5bee-48a4-81a9-00b1be332607","t":"General Settings","c":"This category contains general settings. General Ignored Character Class General Spell check as you type - This enables and disables the spell checker. Naturally, it is enabled by default. The spell checker"},{"f":"bb88f7d5-2491-457e-9ba3-8d7d0bbc8615","t":"Version 2021.1.23.0","c":"Changes in this release: Fixed loading of the default ignored words file in the absence of a default global configuration file. Fixed loading of ignored words files so that words starting with an invalid"},{"f":"bda126a1-e534-4172-81dc-35a32d91e4cc","t":"Common Problems","c":"This topic covers some common problems that you may encounter while using the solution/project spell checking tool window. Files Open in Editors Editing Spell Checked Files Differences in Issues Reported"},{"f":"bdd744a5-4748-4c72-9ba1-dea6374bf5fe","t":"Version 1.0.0.1","c":"Version 1.0.0.1 was released on September 2nd, 2013. Changes in this release: Fixed a bug in the Replace All code to properly maintain first letter casing in each replaced word instance. Updated the installer"},{"f":"c3044e18-d35c-445d-b24b-646f26056f82","t":"Version 2022.12.29.0","c":"This is an update to the 2022.12.11.0 release that fixes a couple of issues with the changes made in it: Added support for the Markdown Editor v2 extension. Added support for C# 11 raw string literals."},{"f":"c592c4d8-7387-47fe-9b79-28bf0168f447","t":"Ignored Words/Keywords","c":"This category lets you define ignored words and keywords that are never presented as misspelled words nor will they appear as suggestions for other misspelled words. This is useful for excluding things"},{"f":"c6fa9223-d59e-0a88-fffb-fe57342f2574","t":"ISpellingService Interface","c":"ISpelling Service Interface This is used to retrieve the spelling service Definition Namespace: VisualStudio.SpellChecker.Definitions Assembly: VisualStudio.SpellChecker.Definitions (in VisualStudio.SpellChecker.Definitions.dll)"},{"f":"d050d252-b188-4eca-b7ab-b33f0b1b1b0a","t":"Version 2017.8.26.0","c":"Changes in this release: Fixed the solution/project spell checker tool window so that the line text in the results grid is limited in length to prevent it from lagging or hanging Visual Studio when misspellings"},{"f":"d121753f-40ad-4bdb-93a6-04c996845b50","t":"Version 2020.4.18.0","c":"Changes in this release: Ensured that at least the default global ignored words file is included in the global configuration when there is no saved configuration file. Fixed a crash in the solution/project"},{"f":"d21e7d61-ad9b-4806-b759-bb82d3ce0333","t":"Version 2016.10.15.0","c":"Changes in this release: Updated the word splitter to better handle all of the uncommon punctuation characters. Added CUDA source code file extensions ( .cu and .cuh ) to the classification configuration"},{"f":"d5b0b38e-0abb-45b2-943f-5628da441785","t":"Version 2015.8.15.0","c":"Important Effective with this release, Visual Studio 2010 and Visual Studio 2012 are no longer supported. With the release of Visual Studio 2015, I needed to reduce the number of versions for which I can"},{"f":"d671e91a-9945-4d1f-9d5c-6035037990d8","t":"Version 2022.9.6.0","c":"Changes in this release: Added support for naming the solution configuration file \u0026quot;.vsspell\u0026quot;. Updated the solution/project spell checker to ignore virtual documents related to the solution or project such"},{"f":"d9dc230f-ae34-464b-a3c2-4a7778907fc9","t":"Converting to .editorconfig Files","c":"Starting with version 2023.5.8.0, configuration settings have been moved from the old XML .vsspell configuration files to .editorconfig settings. This is a significant change from prior versions but has"},{"f":"db9ee77f-6932-4df7-bd06-e94f20fc7450","t":"XML Files","c":"XML files are given special handling to ignore the content of certain elements entirely and to include the values of certain attributes when spell checking is performed. This can greatly reduce the number"},{"f":"ddf22015-1680-4421-aaa7-dda867660522","t":"Correcting Issues","c":"The right side of the tool window contains the following items that allow you to correct issues. The options will be updated based on the issue currently selected in the grid on the left side of the tool"},{"f":"deeba4a0-5a5f-497c-a9c1-7dec64e9c2bf","t":"System Requirements and Building the Code","c":"The code is separated into three branches. The master branch is for Visual Studio 2022 and later and is the default branch for all current and future development. The VSLegacy and VSLegacy2017-2019 branches"},{"f":"df2a45c1-1996-46f6-9d33-e73f0fa1d88a","t":"Add Spell Checking for Third Party Content Types","c":"A NuGet package is available that will allow you to enable spell checking for third-party content types within Visual Studio ( EWSoftware.VSSpellChecker ). This topic provides a simple example of a tagger"},{"f":"dfcecbc6-1e86-4076-b8c6-0d6e94aa1629","t":"Version 2017.3.26.0","c":"Changes in this release: Fixed the suggested action source so that it works properly with HTML files in Visual Studio 2017. Fixed the XML file classifier so that it doesn\u0026#39;t miss comments between the start"},{"f":"e01bd3d9-c525-4407-8c65-fcdb64539299","t":"Code Analysis Dictionaries","c":"This category lets you indicate whether or not to import code analysis dictionaries in the project for use in spelling checking. The imported options are only applied to the spell checked elements (comments,"},{"f":"e1588046-393b-4864-a3c1-6771b73bf124","t":"Version 2021.3.1.0","c":"Changes in this release: Fixed loading of code analysis dictionaries with .NET Core/Standard SDK format project files. Merged changes from Walter Goodwin to add a spell checker toolbar. See Also Other"},{"f":"e1ba871e-548d-41e6-b9e2-b3f61d5a9212","t":"Version 2014.2.23.0","c":"Changes in this release: Fixed escape sequence checking to ignore \\x , \\u , and \\U if not followed by valid hex digits. Added code to check for correct spellings when a word is followed by a period as"},{"f":"e23551ac-52f5-4505-b2d2-0728c7607fd3","t":"Visual Studio WPF Text Boxes","c":"This category lets you enable spell checking for WPF text boxes within any Visual Studio tool window or designer/editor. Exclusion expressions can be added to disable spell checking in text boxes in which"},{"f":"e339cac1-9783-4c2a-919f-88436c78fef8","t":"Installation Instructions and Usage Notes","c":"To install this package: If you currently have a spell checker extension installed, uninstall or disable it before installing this package. Examples are the ones in Resharper and GhostDoc. If using Visual"},{"f":"e4168091-4de6-4a6c-af01-70854d72959f","t":"Version 2020.3.28.0","c":"Changes in this release: All dictionaries are now loaded asynchronously. This helps prevent blocking Visual Studio when large dictionaries or multiple dictionaries are loaded. Support has been added for"},{"f":"e65c2751-130e-5bdb-8507-b19154eefebe","t":"VisualStudio.SpellChecker.Definitions Namespace","c":"Visual Studio. Spell Checker. Definitions Namespace This namespace contains classes used to create new tagger providers for third-party content types so that they can make use of the spell checker. Interfaces"},{"f":"e791c561-0d79-4476-b31a-1f337e295d63","t":"Version 2022.1.3.0","c":"Changes in this release: Added support for Visual Studio 2022 in July 2021. Since it was the only change, no help update was published for that release. Added .tsx as a recognized file extension for solution/project"},{"f":"e8f67bc4-a8f8-4e50-ab5a-876599f3a645","t":"Spell Check as You Type","c":"In text editor windows, misspellings are highlighted by underlining them with a squiggly line. Place the mouse over the word and click the down arrow on the smart tag to see the available options. Alternately,"},{"f":"e9510e5d-6d29-4561-b127-36fe3b3c61ce","t":"Version 2014.9.7.0","c":"Changes in this release: Added support for spell checking in the Visual Studio Peek Definition window. Removed handling of the space character in C-style format string specifiers. Added support for installing"},{"f":"ec4462c0-c063-4a9a-895b-8abad08877ae","t":"Version 2015.9.19.0","c":"Changes in this release: The main feature of this release is the new tool window that allows spell checking of the entire solution, a single project, or whatever items are currently selected in the Solution"},{"f":"f401145a-63b8-48ea-a70c-820b7d58eb15","t":"Version 2025.8.30.0","c":"Changes made in this release: Important As of this release, only Visual Studio 2022 and later are supported. Support for Visual Studio 2017 and 2019 has been dropped. I do not use the older versions anymore,"},{"f":"f9804039-6ccd-48b3-be55-789d78c00ca7","t":"Version 2019.4.14.0","c":"Changes in this release: Fixed a crash caused by cached instances of the preview object in margin lightbulb suggestion lists. Fixed the C-style code tagger to exclude filenames after #include directives"},{"f":"fa790577-88c0-4141-b8f4-d8b70f625cfd","t":"Solution/Project Spell Check Tool Window","c":"Selecting Tools | Spell Checker and choosing one of the solution or project spell check options opens the solution/project spell checker tool window. This tool window will only be usable when a solution"},{"f":"fae83dba-8263-4ac9-a607-8dfa77ffce2c","t":"Version 2015.2.21.0","c":"This release contains a significant change in the way the spell checker configuration options are handled. There is one global configuration as before. However, spell checker configurations can now be"},{"f":"fb81c214-0fe0-4d62-a172-d7928d5b91d5","t":"Configuration Options","c":"Configuration options for the spell checker are stored in .editorconfig files. There is one global configuration that contains the default settings. Spell checker options can also be stored in .editorconfig"},{"f":"v2025.12.12.0","t":"Version 2025.12.12.0","c":"Changes made in this release: Fixed the Markdown tagger so that it works with the updated Markdown content type in Visual Studio 2022 and 2026. See Also Other Resources Version History"}]