[{"f":"02b55692-09e5-820c-e346-497077b8d169","t":"FileParser.SplitToc Property","c":"File Parser Split Toc Property This returns the split TOC flag if found in the topic Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0"},{"f":"02e3b453-2ff3-9617-e2d0-4951603e2e53","t":"IBasePathProvider.BasePath Property","c":"IBase Path Provider Base Path Property This read-only property returns the base path Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0"},{"f":"043da35f-0484-4cb0-b391-83418a8cf7f1","t":"Version 2022.3.12.0","c":"Release notes for version 2022.3.12.0. Changes in This Release Moved the HTML to MAML converter tool out into its own project. See Also Other Resources Version History"},{"f":"0530b286-e2d3-6ca0-0191-a0986ca38f39","t":"ImageReference.ToString Method","c":"Image Reference To String Method Convert to string for debugging purposes Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy"},{"f":"084fb4dc-4ab4-e11d-d355-1a4ee449857b","t":"FilePath.PersistablePath Property","c":"File Path Persistable Path Property This is used to retrieve the file path in a format suitable for persisting to storage based on the current settings. Definition Namespace: HtmlToMamlConversion Assembly:"},{"f":"08816ccd-6c12-247b-c0b5-a2a2a41c4139","t":"Topic.Id Property","c":"Topic Id Property This returns the topic\u0026#39;s unique ID Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy View Source Request Example"},{"f":"0cf58179-488a-182b-fa61-70fd8140b35d","t":"Topic Properties","c":"Properties Body Get or set the topic\u0026#39;s body HelpKeywords Get the help keywords collection Id This returns the topic\u0026#39;s unique ID IsDefaultTopic This returns the default topic flag if found in the topic"},{"f":"0da4eb05-808e-4323-9a62-28ba912125ff","t":"Glossary","c":"A | B | C | D | E | F | G | H | I | J | K | L | M | N | O | P | Q | R | S | T | U | V | W | X | Y | Z C conceptual build A build that uses Sandcastle to produce help file topics using information extracted"},{"f":"0eadf768-8cb1-f1ba-d3cd-5f2bb71ac70d","t":"HtmlToMaml.CreateCompanionFile Method","c":"Html To Maml Create Companion File Method Create a companion file for a topic Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy"},{"f":"0f33f2be-8ce3-1e5e-385e-c6485dd758f4","t":"TagOptions Constructor","c":"Tag Options Constructor Constructor Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy View Source Request Example public TagOptions"},{"f":"1029afb9-f723-3a62-4d24-826b238e29a9","t":"FileParser.RevisionNumber Property","c":"File Parser Revision Number Property This returns the revision number parsed from the file Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0"},{"f":"1251f24a-1ceb-ad8c-c42f-68fcb2e24f7b","t":"FolderPath Class","c":"Folder Path Class This class is used to represent a folder path. Support is included for treating the path as fixed or relative and for expanding environment variables in the path name. Definition Namespace:"},{"f":"1490deb7-2cfb-9b90-20e1-49223345a68c","t":"MSHelpKeywordCollection Methods","c":"MSHelp Keyword Collection Methods Methods Add Adds an object to the end of the Collection T . (Inherited from Collection MSHelpKeyword ) AddNew Adds a new item to the collection. (Inherited from BindingList"},{"f":"15DDCEEF-EB8C-4eed-8EE3-830ECFDBCD82","t":"Markup Wrapper Rules","c":"This section defines HTML elements that themselves or whose content must be retained as HTML in the converted topics. Rule Processing Certain HTML elements may need special handling in order to replace"},{"f":"165a7a7e-b9f0-4fa0-bf96-105f1fdf1163","t":"License","c":"This topic contains the following sections: Microsoft Public License (Ms-PL) Copyright Notices Microsoft Public License (Ms-PL) This license governs use of the accompanying software. If you use the software,"},{"f":"1850fb20-ae42-b71e-6506-635841e97b96","t":"IBasePathProvider Interface","c":"IBase Path Provider Interface This interface defines the properties used to obtain a base path for a FilePath object Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe)"},{"f":"19b6d89f-dbd5-085e-e7f4-11774c284503","t":"HtmlToMaml.BasePath Property","c":"Html To Maml Base Path Property This returns the source path for use as the base path Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0"},{"f":"1BA74307-2C62-40a9-AA25-3B25DFB1C1C6","t":"Conversion Rule Elements","c":"The conversion rules are defined in an XML file that consists of five main parts. Each part is described in the following topics. The default rule set should work quite well for most documents but you"},{"f":"1d908d18-1939-c197-4f16-ef3ae0bdf719","t":"FilePath Events","c":"File Path Events Events PersistablePathChanged This event is raised when the persistable path changes PersistablePathChanging This event is raised when the persistable path is about to be changed See Also"},{"f":"1eeb0cd4-e175-4df5-b7c7-45c45069a27b","t":"Version 1.0.0.0","c":"Version 1.0.0.0 was released on October 25th, 2008. Changes in This Release Initial release. See Also Other Resources Version History"},{"f":"1ef5be30-5aca-3881-6a46-0e7bdf419faf","t":"FilePath.OnPersistablePathChanging Method","c":"File Path On Persistable Path Changing Method This raises the PersistablePathChanging event Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0"},{"f":"1f3f6d57-8e5c-ea93-0153-16fb968129fd","t":"Topic.SplitToc Property","c":"Topic Split Toc Property This returns the split TOC flag if found in the topic Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C#"},{"f":"261c89f3-3e14-0f83-6ba9-35b3c9686ca2","t":"HtmlToMaml.ReportProgress Method","c":"Html To Maml Report Progress Method This is used to report progress during the conversion Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0"},{"f":"27906dab-64d4-0fa3-e2a1-0ff4c8f1542d","t":"Topic.IsDefaultTopic Property","c":"Topic Is Default Topic Property This returns the default topic flag if found in the topic Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0"},{"f":"293aa05c-d581-9b61-9725-be7a14a1086f","t":"MSHelpKeyword Methods","c":"MSHelp Keyword Methods Methods CompareTo Compares this instance to another instance and returns an indication of their relative values. Equals Determines whether the specified object is equal to the current"},{"f":"29716bff-61e2-a20a-873a-1ddd0b165993","t":"HtmlToMamlConversion Namespace","c":"Html To Maml Conversion Namespace This namespace contains the classes used to convert HTML files to MAML topic files. Classes ConversionProgressEventArgs This is a custom event arguments class for the"},{"f":"2ae43048-005b-6ebb-b821-0a004c88fb83","t":"MSHelpKeywordCollection Constructor","c":"MSHelp Keyword Collection Constructor Initializes a new instance of the MSHelpKeywordCollection class Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version:"},{"f":"2b6d39c9-d945-b3a7-cf60-07ff12efa595","t":"FileParser.ParseFile Method","c":"File Parser Parse File Method Parse the specified HTML file Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy View Source Request"},{"f":"2bd15e5e-45df-2c0a-422d-9a89b097c4ba","t":"FileParser.Body Property","c":"File Parser Body Property This returns the HTML body parsed from the file Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy"},{"f":"2cdd462b-1449-2020-1753-de02b10e5866","t":"MSHelpKeywordCollection Properties","c":"MSHelp Keyword Collection Properties Properties AllowEdit Gets or sets a value indicating whether items in the list can be edited. (Inherited from BindingList MSHelpKeyword ) AllowNew Gets or sets a value"},{"f":"2dae29b2-2017-2a59-aa87-f2b18c57ac78","t":"TopicCollection.Save Method","c":"Topic Collection Save Method Save the topic collection to the named content layout file Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0"},{"f":"2e5eaf92-d354-e97f-b654-37c2b73516ee","t":"FilePath.BasePath Property","c":"File Path Base Path Property This returns the base path for the object Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy View"},{"f":"2e61f839-012f-e56b-2899-8963afa36bcc","t":"FolderPath(String, Boolean, IBasePathProvider) Constructor","c":"Folder Path(String, Boolean, IBase Path Provider) Constructor Constructor. Assign the specified path and fixed setting. Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe)"},{"f":"2f683e11-b01f-b743-f709-77a622668f43","t":"ConvertHtmlToMaml Methods","c":"Convert Html To Maml Methods Methods Main Main program entry point See Also Reference ConvertHtmlToMaml Class HtmlToMamlConversion Namespace"},{"f":"35c0b398-b395-76fb-7dc3-025fa6daaeb1","t":"TopicCollection.Sort Method","c":"Topic Collection Sort Method This is used to sort the collection Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy View Source"},{"f":"364ae522-2210-6d3d-6c1b-22e2418d4883","t":"Topic.ToString Method","c":"Topic To String Method Convert to string for debugging purposes Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy View Source"},{"f":"36c06861-16fc-ddd4-a52c-b1eedcdc89c2","t":"FileParser.TopicAbstract Property","c":"File Parser Topic Abstract Property This returns the abstract parsed from the file Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0"},{"f":"387a2523-d988-9a60-1699-9d00fbb11f21","t":"FilePath.Path Property","c":"File Path Path Property This is used to get or set the path to use. Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy View Source"},{"f":"3a087036-29b9-61c9-73a2-1f638a026053","t":"ImageReference Class","c":"Image Reference Class This represents an image reference Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy View Source Request"},{"f":"3a4b9b11-4c53-fc62-fe32-aed4379ceef2","t":"FileParser Methods","c":"File Parser Methods Methods Equals Determines whether the specified object is equal to the current object. (Inherited from Object ) Finalize Allows an object to try to free resources and perform other"},{"f":"3b88e8aa-9199-18b1-acb0-b4a0d3a75992","t":"Topic.Subtopics Property","c":"Topic Subtopics Property This is used to get the collection of sub-topics, if any Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0"},{"f":"40a012a8-5172-4805-a7b0-57a80e99ec5f","t":"Common Issues and Solutions","c":"This topic covers some common issues that you will encounter when reviewing topics after conversion along with tips on solving them. Missing end elements These can be found by performing a build with your"},{"f":"429f68df-21c1-a160-53e6-b4c04653c130","t":"FolderPath.TerminatePath Method","c":"Folder Path Terminate Path Method This can be used to ensure that a path is terminated with a trailing backslash. Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe)"},{"f":"46dfad32-5ae6-48aa-877f-d2c4443258f3","t":"Replace Rules","c":"This section defines HTML elements that can be replaced with a MAML equivalent. Rule Processing The rules in this section make an attempt at replacing HTML elements with the closest MAML equivalent. The"},{"f":"48b81c54-a5df-e7b1-d5a2-8eb893f1a52f","t":"TagOptions Properties","c":"Tag Options Properties Properties Attributes This returns the attributes to use based on the last evaluation Closing This returns the closing \u0026quot;/\u0026quot; if the element is an end tag Tag This returns the replacement"},{"f":"49156662-ce04-e598-8809-7a03087f433f","t":"FileParser.Title Property","c":"File Parser Title Property This returns the title parsed from the file Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy View"},{"f":"4cf5eadc-f4b0-780e-75dd-5145c3f23f7c","t":"HtmlToMaml.OnConversionProgress Method","c":"Html To Maml On Conversion Progress Method This raises the ConversionProgress event. Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0"},{"f":"4dea1b3f-f33a-26c7-5b37-d0d975061e03","t":"TopicCollection Class","c":"Topic Collection Class This is a collection of topic items Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy View Source Request"},{"f":"4f4bf1fa-7ee0-3b43-5479-0852101689c7","t":"TopicCollection Properties","c":"Topic Collection Properties Properties Count Gets the number of elements actually contained in the Collection T . (Inherited from Collection Topic ) DefaultTopic This is used to get the default topic Item"},{"f":"5130999b-0f7b-6783-382c-5bb475f4d379","t":"Topic.SortOrder Property","c":"Topic Sort Order Property This returns the sort order value if found in the topic Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0"},{"f":"51fc009a-53fa-c72c-d341-d153d08c8c3c","t":"FileParser.SortOrder Property","c":"File Parser Sort Order Property This returns the sort order value if found in the topic Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0"},{"f":"532848e7-28d0-d6de-1774-0d2267a23383","t":"FilePath.AbsoluteToRelativePath Method","c":"File Path Absolute To Relative Path Method This helper method can be used to convert an absolute path to one that is relative to the given base path. Definition Namespace: HtmlToMamlConversion Assembly:"},{"f":"54832236-0c58-c086-7606-f607a6d94dd4","t":"FileParser.TopicId Property","c":"File Parser Topic Id Property This returns the topic ID parsed from the file Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy"},{"f":"56879d39-efe5-2c39-ceaf-2f0c3c98f54f","t":"FilePath Properties","c":"File Path Properties Properties BasePath This returns the base path for the object BasePathProvider This is used to get the base path provider for the object. Exists This read-only property can be used"},{"f":"5965ca1c-6428-ac4e-5d9c-e80b297057b6","t":"TagOptions Class","c":"Tag Options Class This is used to contain the options and state for a Tag entry from the conversion rules file Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe)"},{"f":"5C35957F-DADF-4965-9FB9-18AF0C6A77E7","t":"Remove Rules","c":"This section defines HTML elements that must be removed from the converted topics because they lack a MAML equivalent. Rule Processing Certain HTML elements have no MAML equivalent and serve no purpose"},{"f":"5d7a8bd9-852b-b687-e17d-3920a6622eeb","t":"FilePath.Exists Property","c":"File Path Exists Property This read-only property can be used to determine whether or not the file path exists Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe)"},{"f":"5DDF5E27-152A-4fbf-A0DE-B4444A7102F0","t":"The BodyExtract Element","c":"This element defines the regular expression used to extract the body of the HTML document. Rule Processing By default it extracts the \u0026lt;body\u0026gt; (.html files) or \u0026lt;bodyText\u0026gt; (.topic files) element content."},{"f":"5ed6a1fd-7d8e-4da6-baa6-60c663218106","t":"Version History","c":"The topics in this section describe the various changes made to the HTML to MAML Converter over the life of the project. Version History Select a version below to see a description of its changes. Version"},{"f":"64591205-b547-cd0a-3df1-a84498084bf5","t":"HtmlToMaml Methods","c":"Html To Maml Methods Methods ConvertTopic This is called to convert a single topic and its children ConvertTopics This is called to perform the actual conversion CreateCompanionFile Create a companion"},{"f":"65bee6ab-8044-ad12-16a8-e7b793fde5b2","t":"FolderPath(String, IBasePathProvider) Constructor","c":"Folder Path(String, IBase Path Provider) Constructor Constructor. Assign the specified path. Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0"},{"f":"65ff60ed-d9f9-0afd-9336-2470803e518a","t":"FilePath.OnPersistablePathChanged Method","c":"File Path On Persistable Path Changed Method This raises the PersistablePathChanged event Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0"},{"f":"66ebaf53-04c9-8280-06ee-2409f3016402","t":"ImageReferenceCollection.Save Method","c":"Image Reference Collection Save Method Write the image reference collection to a media content file. Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version:"},{"f":"69360a87-93af-9e0c-bcf1-b585ade09b08","t":"TagOptions.Attributes Property","c":"Tag Options Attributes Property This returns the attributes to use based on the last evaluation Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version:"},{"f":"6b3550fd-6773-d830-0eeb-6857cb86e170","t":"FilePath.IsFixedPath Property","c":"File Path Is Fixed Path Property This is used to indicate whether or not the path will be treated as a relative or fixed path when converted retrieved via the PersistablePath property. Definition Namespace:"},{"f":"6ccc8515-7d18-277f-57bd-2f687d810996","t":"HtmlToMaml Properties","c":"Html To Maml Properties Properties BasePath This returns the source path for use as the base path PathProvider This returns the base path provider for the other classes involved in the conversion that"},{"f":"6d8e2cb8-b811-dd1c-eded-42d3641bea4d","t":"FilePath Implicit Conversion (FilePath to String)","c":"File Path Conversion (File Path to String) This is used to handle an implicit conversion from a FilePath object to a string Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe)"},{"f":"6DFF3A5E-765C-44eb-8E90-E3C6EFEBEC06","t":"Entities Rules","c":"This section defines named entities that must be converted to their numeric equivalent in the MAML topic files. Rule Processing The .NET XML parser only recognizes the common ASCII named entities ( \u0026amp;amp;"},{"f":"71862c3b-98bd-f604-700c-3d4527131684","t":"IBasePathProvider Properties","c":"IBase Path Provider Properties Properties BasePath This read-only property returns the base path See Also Reference IBasePathProvider Interface HtmlToMamlConversion Namespace"},{"f":"723cc773-809d-750e-a1f7-c2f7481d40e6","t":"FilePath.ToString Method","c":"File Path To String Method Convert the file path to a string Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy View Source Request"},{"f":"76465f10-1d81-cb6f-ec6f-c2fed5ab6bea","t":"MSHelpKeyword Properties","c":"MSHelp Keyword Properties Properties Index This is used to get or set the index name Term This is used to get or set the index term See Also Reference MSHelpKeyword Class HtmlToMamlConversion Namespace"},{"f":"76729a2e-4d4e-2570-c5bf-163bb84cf155","t":"FilePath.Inequality Operator","c":"File Path Inequality Operator Overload for not equal operator. Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy View Source"},{"f":"76834da6-a4c8-4c65-a6b4-c09024100b64","t":"Metadata Topic Elements","c":"Certain topic elements not represented in the rules file are searched for in order to extract common metadata that will be associated with the converted topic files: The Title Element Index Keyword Elements"},{"f":"7bf65eab-ab1d-e627-49aa-245586fe6cd5","t":"ImageReference.AlternateText Property","c":"Image Reference Alternate Text Property Get or set the image\u0026#39;s alternate text Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy"},{"f":"7e7ef3ca-0712-bd6d-cac6-674bf47b5693","t":"MSHelpKeywordCollection.MarkAsDirty Method","c":"MSHelp Keyword Collection Mark As Dirty Method This is used to mark the collection as changed when there is no associated project Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml"},{"f":"7eb7fc9e-593c-712b-63fc-4722e928aebb","t":"TopicCollection.AddTopicsFromFolder Method","c":"Topic Collection Add Topics From Folder Method Add all topics from the specified folder recursively to the topic collection Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe)"},{"f":"7fe3a49d-1e4e-9bde-a517-7bc19aa409c9","t":"FilePath(String, Boolean, IBasePathProvider) Constructor","c":"File Path(String, Boolean, IBase Path Provider) Constructor Constructor. Assign the specified path and fixed setting. Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe)"},{"f":"805843ba-dc39-f3a2-3d6f-1e8711b4bd9d","t":"Topic.HelpKeywords Property","c":"Topic Help Keywords Property Get the help keywords collection Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy View Source"},{"f":"80c7b33b-4dae-4ba3-3ece-cc5d7063c909","t":"MSHelpKeyword.Index Property","c":"MSHelp Keyword Index Property This is used to get or set the index name Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy View"},{"f":"83b3d408-4e02-42d2-beed-0b13294f23f2","t":"Welcome","c":"Welcome to the HTML to MAML Converter. This utility is used to convert HTML files to Microsoft Assistance Markup Language (MAML) topic files so that they can be compiled into help files using the Sandcastle"},{"f":"85960545-1350-6c5f-c2ae-0d2021cd5531","t":"MSHelpKeyword.GetHashCode Method","c":"MSHelp Keyword Get Hash Code Method Get a hash code for this item Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy View Source"},{"f":"85e34c09-0835-b0ca-eb04-14d9cac2baed","t":"TagOptions Methods","c":"Tag Options Methods Methods Equals Determines whether the specified object is equal to the current object. (Inherited from Object ) Evaluate Evaluate the match and determine the properties to use for the"},{"f":"866ba0c4-b3b6-7602-2d69-a9ad437aa2b6","t":"Topic Constructor","c":"Constructor Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy View Source Request Example public Topic ( string source ) VB"},{"f":"866eb57e-884d-2ca9-3959-c49f7069dae8","t":"ConvertHtmlToMaml.Main Method","c":"Convert Html To Maml Main Method Main program entry point Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy View Source Request"},{"f":"86ae9938-304e-66ea-7cca-b44ab047f827","t":"MSHelpKeyword(String, String) Constructor","c":"MSHelp Keyword(String, String) Constructor Constructor Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy View Source Request"},{"f":"88706943-3ecb-4435-9107-ee96821ef856","t":"Using the Converter","c":"This topic will walk you through using the converter to convert a batch of HTML files to MAML topics. Using the Converter The converter is a console mode application. As such, open a command prompt in"},{"f":"892644dd-7a45-00ee-71ef-e4b7e2cb5555","t":"Topic Class","c":"This represents a topic file Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy View Source Request Example public class Topic"},{"f":"89bb871f-7389-7586-acde-e282fda3211b","t":"HtmlToMaml.ConvertTopic Method","c":"Html To Maml Convert Topic Method This is called to convert a single topic and its children Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0"},{"f":"8c45632b-4b04-9b00-df43-a6e28094cf27","t":"FolderPath Methods","c":"Folder Path Methods Methods Clone This returns a clone of the object (Inherited from FilePath ) Equals This is overridden to allow proper comparison of file path objects. (Inherited from FilePath ) Finalize"},{"f":"8cdda8ef-f68d-993e-41e7-010f04d0b6f1","t":"ImageReference Properties","c":"Image Reference Properties Properties AlternateText Get or set the image\u0026#39;s alternate text Id This returns the image\u0026#39;s unique ID SourceFile This is used to get the source image filename See Also Reference"},{"f":"8ce0b754-bf09-b3d3-4ac8-36031c0a304f","t":"TopicCollection.SplitTocAtTopic Property","c":"Topic Collection Split Toc At Topic Property This is used to get the topic at which the table of content is split by the API content Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml"},{"f":"8d318ab3-7765-e4c2-8d6a-82964864dbbf","t":"ImageReference.Id Property","c":"Image Reference Id Property This returns the image\u0026#39;s unique ID Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy View Source"},{"f":"8dc04691-5110-3ba1-d935-656669cb12eb","t":"MSHelpKeyword Constructor","c":"MSHelp Keyword Constructor Constructor Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy View Source Request Example public"},{"f":"8e5bd303-2612-a0bb-dab0-9668cdfacc91","t":"Topic.Title Property","c":"Topic Title Property Get or set the topic\u0026#39;s title Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy View Source Request Example"},{"f":"8f51f888-0bb0-4a22-8058-50eaac7a6c2d","t":"Version 1.0.0.1","c":"Version 1.0.0.1 was released on July 26th, 2010. Changes in This Release Fixed a bug that caused a crash when a JavaScript reference was encountered in an anchor tag\u0026#39;s HREF attribute. Such references are"},{"f":"8f5b75df-84b0-ca13-e74c-c84848ecdcb4","t":"ImageReferenceCollection Methods","c":"Image Reference Collection Methods Methods Add Adds an object to the end of the Collection T . (Inherited from Collection ImageReference ) Clear Removes all elements from the Collection T . (Inherited"},{"f":"911023f7-8bab-de5b-d4ea-1589c12f9c2a","t":"HtmlToMaml.ConversionProgress Event","c":"Html To Maml Conversion Progress Event This event is raised to report progress information throughout the conversion process. Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in"},{"f":"9242c082-4ef4-3cf2-31a4-045db80bc90e","t":"TopicCollection Constructor","c":"Topic Collection Constructor Initializes a new instance of the TopicCollection class Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0"},{"f":"969b042a-6665-bdc5-f344-e47ddfe09051","t":"FilePath.GetFullPath Method","c":"File Path Get Full Path Method This returns the fully qualified path for the specified path. This version allows wildcards in the filename part if present. Definition Namespace: HtmlToMamlConversion Assembly:"},{"f":"96b3818e-0390-edf7-9756-a86b0076f563","t":"HtmlToMaml.ConvertTopics Method","c":"Html To Maml Convert Topics Method This is called to perform the actual conversion Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0"},{"f":"97b65ef5-26d1-faee-1223-5a7fb50a09fe","t":"Topic.Body Property","c":"Topic Body Property Get or set the topic\u0026#39;s body Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy View Source Request Example"},{"f":"97c3e713-2649-6d05-73a2-25e10a326ca1","t":"FolderPath.Path Property","c":"Folder Path Path Property This is used to get or set the path. Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy View Source"},{"f":"99ccd125-44c1-1baf-68b2-e697a855d04f","t":"FilePath.BasePathProvider Property","c":"File Path Base Path Provider Property This is used to get the base path provider for the object. Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version:"},{"f":"9b3db097-04c4-c93e-872c-82628198e218","t":"FilePath.PersistablePathChanging Event","c":"File Path Persistable Path Changing Event This event is raised when the persistable path is about to be changed Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe)"},{"f":"9d7340e5-c4bc-449e-9db1-e087c097880a","t":"ImageReference Constructor","c":"Image Reference Constructor Constructor Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy View Source Request Example public"},{"f":"9f8dd7f6-06f3-0ac5-3b35-e98c6ce945c7","t":"MSHelpKeyword.ToString Method","c":"MSHelp Keyword To String Method Return a string representation of the item Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy"},{"f":"a01c382e-2031-6a02-45cb-79ddf8cb8ed9","t":"HtmlToMaml Class","c":"Html To Maml Class This class is used to convert a set of HTML file to their close equivalent as conceptual MAML topic files Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe)"},{"f":"a4584c6b-1a34-ae1b-4df8-ec586dc6f5e7","t":"FilePath(IBasePathProvider) Constructor","c":"File Path(IBase Path Provider) Constructor Default constructor. The file path is undefined. Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0"},{"f":"a5cd8288-a41c-518b-60ee-69a2c894bd60","t":"FolderPath Properties","c":"Folder Path Properties Properties BasePath This returns the base path for the object (Inherited from FilePath ) BasePathProvider This is used to get the base path provider for the object. (Inherited from"},{"f":"a5f36b5f-5551-43c4-a938-c1451571b97f","t":"Warnings and To Do Items","c":"This topic describes the various warnings and To Do items you will see in the conversion log file and the converted topics. Warnings The following warnings may appear in the log file. Warning: Found unknown"},{"f":"a6a57abf-fe91-33e4-e804-3e08b789c9e2","t":"FileParser.HelpKeywords Property","c":"File Parser Help Keywords Property This returns the help keywords parsed from the file Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0"},{"f":"a93a9c32-5af3-f8d0-399f-c34af134b453","t":"ConversionProgressEventArgs Methods","c":"Conversion Progress Event Args Methods Methods Equals Determines whether the specified object is equal to the current object. (Inherited from Object ) Finalize Allows an object to try to free resources"},{"f":"aa7d6fdb-5fc4-592c-799b-dd82b086a6de","t":"FilePath.ExpandedPath Property","c":"File Path Expanded Path Property This read-only property is used to display the fully qualified path with environment variable expansions in the designer. Definition Namespace: HtmlToMamlConversion Assembly:"},{"f":"aadfc752-77b8-a622-3ec9-1ce0583b5a96","t":"FilePath.RelativeToAbsolutePath Method","c":"File Path Relative To Absolute Path Method This helper method can be used to convert a relative path to an absolute path based on the given base path. Definition Namespace: HtmlToMamlConversion Assembly:"},{"f":"abad23b8-2e55-7163-635b-35fa8e6dc20e","t":"FilePath Class","c":"File Path Class This class is used to represent a file path. Support is included for treating the path as fixed or relative and for expanding environment variables in the path name. Definition Namespace:"},{"f":"ae875afc-3fcd-57c2-3f5a-da5d3ca0ebf6","t":"ConversionProgressEventArgs Class","c":"Conversion Progress Event Args Class This is a custom event arguments class for the ConversionProgress event Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe)"},{"f":"af412052-b751-6224-cb01-c9a207cf75cf","t":"FileParser Class","c":"File Parser Class This is used to parse an HTML file to extract the various parts for conversion to MAML Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe)"},{"f":"b0b1158e-b382-f83a-ef8a-6015ce848166","t":"Topic.ParseFile Method","c":"Topic Parse File Method Parse the topic and its sub-topic files to extract the information for conversion Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe)"},{"f":"b0f294cf-7f90-4785-b5f5-7ebcb49b5b43","t":"MSHelpKeyword.CompareTo Method","c":"MSHelp Keyword Compare To Method Compares this instance to another instance and returns an indication of their relative values. Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in"},{"f":"b13edb7e-9ba4-f63d-ab26-f4d3cca97f91","t":"FilePath Operators and Type Conversions","c":"File Path Operators and Type Conversions Operators Equality(FilePath, FilePath) Overload for equal operator. (FilePath to String) This is used to handle an implicit conversion from a FilePath object to"},{"f":"b550ba73-6518-668f-a01b-a1c5a4351ad1","t":"Topic.SourceFile Property","c":"Topic Source File Property This is used to get the source HTML filename Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy View"},{"f":"b7e46af5-0901-41e8-afb9-a79a837aff9e","t":"Additional Output Files","c":"The following files are created in addition to the converted topic files and can be found in the destination folder after the conversion has completed. _Conversion.log This file contains the output from"},{"f":"b95d6ace-6cba-0e2f-0308-74de1f8d7998","t":"MSHelpKeyword.Equals Method","c":"MSHelp Keyword Equals Method Determines whether the specified object is equal to the current object. Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version:"},{"f":"bc8310af-2842-bd88-0d24-1962ec97aa5e","t":"MSHelpKeywordCollection Events","c":"MSHelp Keyword Collection Events Events AddingNew Occurs before an item is added to the list. (Inherited from BindingList MSHelpKeyword ) ListChanged Occurs when the list or an item in the list changes."},{"f":"bcedaf8e-8602-9540-3385-670fe7d1da7c","t":"FileParser.TocExclude Property","c":"File Parser Toc Exclude Property This returns the TOC exclude flag if found in the topic Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0"},{"f":"bfac4855-e05f-6ac0-5687-00c44f4558c7","t":"ConvertHtmlToMaml Class","c":"Convert Html To Maml Class This utility is used to convert HTML files to MAML topics and create some supporting files. Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe)"},{"f":"bff92669-84d4-0adb-fddf-d4984aa5c124","t":"MSHelpKeyword.Term Property","c":"MSHelp Keyword Term Property This is used to get or set the index term Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy View"},{"f":"c18d6cb6-e4e4-4944-84ee-f867aa6cfb0d","t":"Links to Resources","c":"This topics contains links to various resources that you may find useful. Links to Resources The latest version of the Sandcastle Help File Builder . For a comprehensive list of MAML documentation tags"},{"f":"c2cdeb98-e327-1567-5976-a304469dd906","t":"FileParser.ReadWithEncoding Method","c":"File Parser Read With Encoding Method This is used to read in a file using an appropriate encoding method Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe)"},{"f":"c5862137-8c0d-fc49-1382-da19d88809d5","t":"FileParser.BodyExtractExpression Property","c":"File Parser Body Extract Expression Property This is used to get or set the body extract regular expression Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe)"},{"f":"c5d48b5a-b125-20c9-b28e-3d0c6db73d32","t":"FileParser.IsDefaultTopic Property","c":"File Parser Is Default Topic Property This returns the default topic flag if found in the topic Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version:"},{"f":"c6173aaa-6552-bef4-474a-e4629ad47e53","t":"FolderPath.Exists Property","c":"Folder Path Exists Property This read-only property can be used to determine whether or not the folder path exists Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe)"},{"f":"c6b3f707-d28f-b3cd-bde9-0fe16f64c856","t":"FolderPath.IsPathTerminated Method","c":"Folder Path Is Path Terminated Method This can be used to find out if a path is terminated with a trailing backslash Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe)"},{"f":"cc2e3764-7a1d-10e5-6d2a-a5fed585d101","t":"FilePath.PersistablePathChanged Event","c":"File Path Persistable Path Changed Event This event is raised when the persistable path changes Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version:"},{"f":"cde6fa8b-a77e-3cc7-2064-635a058e246a","t":"HtmlToMaml Constructor","c":"Html To Maml Constructor Constructor Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy View Source Request Example public HtmlToMaml"},{"f":"ce0e2231-55ad-766d-bd16-a06f970d2271","t":"MSHelpKeywordCollection.Sort Method","c":"MSHelp Keyword Collection Sort Method This is used to sort the collection Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy"},{"f":"ce366d6d-9b7b-8842-8e41-36e86bf265b9","t":"TopicCollection.DefaultTopic Property","c":"Topic Collection Default Topic Property This is used to get the default topic Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy"},{"f":"cfab3486-c580-6f95-14ce-105ebbbc2305","t":"FilePath Constructor","c":"File Path Constructor There are three overloads for the constructor. Overload List FilePath(IBasePathProvider) Default constructor. The file path is undefined. FilePath(String, IBasePathProvider) Constructor."},{"f":"d212ecc8-e261-3877-75c6-9536dfe5403e","t":"ImageReferenceCollection Class","c":"Image Reference Collection Class This is a collection of image references Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy"},{"f":"d2fdb41a-ba27-038c-7f1e-1e3a5b1227af","t":"FileParser Constructor","c":"File Parser Constructor Initializes a new instance of the FileParser class Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy"},{"f":"d3d71f98-fb0b-ce15-deeb-73c84e101a6e","t":"ConversionProgressEventArgs Constructor","c":"Conversion Progress Event Args Constructor Constructor Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy View Source Request"},{"f":"d4b9f6a3-5b31-ae63-2956-707ed83e5618","t":"ImageReferenceCollection Properties","c":"Image Reference Collection Properties Properties Count Gets the number of elements actually contained in the Collection T . (Inherited from Collection ImageReference ) Item Gets or sets the element at"},{"f":"d59acdaa-b800-3522-f532-c1acc40f5a1f","t":"FolderPath Constructor","c":"Folder Path Constructor There are three overloads for the constructor. Overload List FolderPath(IBasePathProvider) Default constructor. The folder path is undefined. FolderPath(String, IBasePathProvider)"},{"f":"d5cce833-6793-d4b2-d1dc-acd86789b127","t":"TagOptions.Tag Property","c":"Tag Options Tag Property This returns the replacement tag to use based on the last evaluation. Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version:"},{"f":"d6728a9e-b69a-cf27-1c53-7bdeeb33ebec","t":"Topic Methods","c":"Methods Equals Determines whether the specified object is equal to the current object. (Inherited from Object ) Finalize Allows an object to try to free resources and perform other cleanup operations before"},{"f":"da999e5b-3302-a543-54c4-aa2982201234","t":"TopicCollection.ParseFiles Method","c":"Topic Collection Parse Files Method Parse all files in the collection to extract the information for conversion Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe)"},{"f":"dbef2779-1019-525d-d774-eedf04e014ba","t":"ConversionProgressEventArgs Properties","c":"Conversion Progress Event Args Properties Properties Message Get the message associated with the progress report See Also Reference ConversionProgressEventArgs Class HtmlToMamlConversion Namespace"},{"f":"dcded896-51a7-4af4-b1dc-9a41193210cc","t":"The Conversion Process","c":"Unlike MAML topics which must be well-formed XML, HTML files are not necessarily as strict in their conformance to such rules. End tags are not always present, the \u0026quot;/\u0026quot; in self-closing tags is not always"},{"f":"dcf15584-16e4-eade-2e20-b3387fcfc356","t":"TagOptions.Closing Property","c":"Tag Options Closing Property This returns the closing \u0026quot;/\u0026quot; if the element is an end tag Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0"},{"f":"dd3ba791-d9f6-21a0-e04d-85b166549aa3","t":"Topic.TopicAbstract Property","c":"Topic Topic Abstract Property Get or set the topic\u0026#39;s abstract Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy View Source"},{"f":"dd7370ab-5498-8ca3-26d3-386f24d972ee","t":"FilePath.GetHashCode Method","c":"File Path Get Hash Code Method Get a hash code for the file path object Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy View"},{"f":"dec5f4b0-9010-6116-0ee7-7d228a7c35df","t":"TagOptions.Evaluate Method","c":"Tag Options Evaluate Method Evaluate the match and determine the properties to use for the replacement Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe)"},{"f":"df0846b7-447f-92a7-7553-924147f76bdc","t":"MSHelpKeywordCollection.WriteXml Method","c":"MSHelp Keyword Collection Write Xml Method This is used to save the keyword collection to the project file Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe)"},{"f":"e3258a49-b829-1780-8713-08ca787004e9","t":"ImageReference Methods","c":"Image Reference Methods Methods Equals Determines whether the specified object is equal to the current object. (Inherited from Object ) Finalize Allows an object to try to free resources and perform other"},{"f":"e3599110-a4db-40f7-5e2a-d7cce82cf879","t":"Topic.TocExclude Property","c":"Topic Toc Exclude Property This returns the TOC exclude flag if found in the topic Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0"},{"f":"e5711c16-2652-05fc-10d1-7dab4a922462","t":"FileParser Properties","c":"File Parser Properties Properties Body This returns the HTML body parsed from the file BodyExtractExpression This is used to get or set the body extract regular expression HelpKeywords This returns the"},{"f":"e6fb7d6d-6b9f-0d27-045a-2eb5cfef349d","t":"FilePath(String, IBasePathProvider) Constructor","c":"File Path(String, IBase Path Provider) Constructor Constructor. Assign the specified path. Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0"},{"f":"e6fcd57c-5b7b-333a-9d44-49773546ce3e","t":"TopicCollection Methods","c":"Topic Collection Methods Methods Add Adds an object to the end of the Collection T . (Inherited from Collection Topic ) AddTopicsFromFolder Add all topics from the specified folder recursively to the topic"},{"f":"e7843f67-6dfb-31a0-5e80-c30453a6324c","t":"HtmlToMaml Events","c":"Html To Maml Events Events ConversionProgress This event is raised to report progress information throughout the conversion process. See Also Reference HtmlToMaml Class HtmlToMamlConversion Namespace"},{"f":"eafdfc49-dbe0-19c1-5ea8-141ef43ba92b","t":"FolderPath Events","c":"Folder Path Events Events PersistablePathChanged This event is raised when the persistable path changes (Inherited from FilePath ) PersistablePathChanging This event is raised when the persistable path"},{"f":"ee480d77-3c1c-9bd6-e233-c26129e26d49","t":"MSHelpKeywordCollection Class","c":"MSHelp Keyword Collection Class This collection class is used to hold the help index keyword items for a project Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe)"},{"f":"ef0faec5-27c7-e294-c6f7-117fb4f9608e","t":"ConversionProgressEventArgs.Message Property","c":"Conversion Progress Event Args Message Property Get the message associated with the progress report Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version:"},{"f":"effcf6b8-7d19-0ad7-32d6-651360509620","t":"FilePath.Equality Operator","c":"File Path Equality Operator Overload for equal operator. Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy View Source Request"},{"f":"f18021ee-6218-f154-2237-2ea3dd009388","t":"MSHelpKeyword Constructor","c":"MSHelp Keyword Constructor Overload List MSHelpKeyword Constructor MSHelpKeyword(String, String) Constructor See Also Reference MSHelpKeyword Class HtmlToMamlConversion Namespace"},{"f":"f1827d70-6641-4d9a-78c7-fd7636832cb9","t":"ImageReference.SourceFile Property","c":"Image Reference Source File Property This is used to get the source image filename Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0"},{"f":"f1fcad71-6d37-77c2-2292-a39f35b235f0","t":"Topic.RevisionNumber Property","c":"Topic Revision Number Property Get or set the topic\u0026#39;s revision number Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy View"},{"f":"f346f326-c66b-22a5-5f68-83dbc396f2bc","t":"FilePath.Equals Method","c":"File Path Equals Method This is overridden to allow proper comparison of file path objects. Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0"},{"f":"f5d9d967-28b6-c77d-2d13-86badb5517fc","t":"MSHelpKeyword Class","c":"MSHelp Keyword Class This represents an HTML Help 2.x index keyword that can be added to the XML data island in each help topic generated by BuildAssembler. Definition Namespace: HtmlToMamlConversion Assembly:"},{"f":"f6e2bbe0-34ad-e391-36ab-a68a12d6f934","t":"HtmlToMaml.PathProvider Property","c":"Html To Maml Path Provider Property This returns the base path provider for the other classes involved in the conversion that need relative paths. Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml"},{"f":"f6e7385f-0647-4897-9145-3c297f4f6c69","t":"Context-based Conversions","c":"The following HTML elements must be converted based on their context within the topic. Since the context is hard to translate into an easily defined rule in the rules file, the elements described in this"},{"f":"f830609c-0fba-c925-eeee-ba2cbebe105e","t":"FilePath.Clone Method","c":"File Path Clone Method This returns a clone of the object Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version: 2022.3.11.0 C# Copy View Source Request"},{"f":"fd0537b4-9598-029f-6f0e-07b2c48a7080","t":"ImageReferenceCollection Constructor","c":"Image Reference Collection Constructor Initializes a new instance of the ImageReferenceCollection class Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe)"},{"f":"fd1f2839-51ab-56c6-04ae-9443291d78b5","t":"FilePath Methods","c":"File Path Methods Methods AbsoluteToRelativePath This helper method can be used to convert an absolute path to one that is relative to the given base path. Clone This returns a clone of the object Equals"},{"f":"fdcca85f-39a7-3e85-0a0a-96664f2d6006","t":"FolderPath(IBasePathProvider) Constructor","c":"Folder Path(IBase Path Provider) Constructor Default constructor. The folder path is undefined. Definition Namespace: HtmlToMamlConversion Assembly: ConvertHtmlToMaml (in ConvertHtmlToMaml.exe) Version:"}]