[{"f":"014afa8b-5c67-36e5-5b58-29a8b6e4abd2","t":"VBCodeProviderWithDocs Properties","c":"VBCode Provider With Docs Properties Properties CanRaiseEvents Gets a value indicating whether the component can raise an event. (Inherited from Component ) Container Gets the IContainer that contains"},{"f":"033d9ec4-0cc6-e729-6055-706f5697a5df","t":"CSharpCodeProviderWithDocs Constructor","c":"CSharp Code Provider With Docs Constructor Default constructor Definition Namespace: EWSoftware.CodeDom Assembly: EWSoftware.CodeDom (in EWSoftware.CodeDom.dll) Version: 2022.3.12.0 C# Copy View Source"},{"f":"043da35f-0484-4cb0-b391-83418a8cf7f1","t":"Version 2022.3.12.0","c":"Release notes for version 2022.3.12.0. Changes in This Release Moved the Web Code Providers assembly out into its own project. See Also Other Resources Version History"},{"f":"325348ae-81de-1fc1-c7c5-fc19667a4e9e","t":"CSharpCodeProviderWithDocs.CompileAssemblyFromFile Method","c":"CSharp Code Provider With Docs Compile Assembly From File Method Compiles an assembly from the source code contained in the specified files, using the specified compiler settings. Definition Namespace:"},{"f":"345ec7a6-6f2d-e5a4-f905-a1b342736fc2","t":"VBCodeProviderWithDocs(IDictionary\u0026amp;lt;String, String\u0026amp;gt;) Constructor","c":"VBCode Provider With Docs(IDictionary String, String ) Constructor This constructor is passed a provider options dictionary Definition Namespace: EWSoftware.CodeDom Assembly: EWSoftware.CodeDom (in EWSoftware.CodeDom.dll)"},{"f":"3d4a723f-e658-183b-c452-e8bf17918abd","t":"CSharpCodeProviderWithDocs.CompileAssemblyFromDom Method","c":"CSharp Code Provider With Docs Compile Assembly From Dom Method Compiles an assembly based on the System.CodeDom trees contained in the specified array of CodeCompileUnit objects, using the specified compiler"},{"f":"3e4b2bba-c32d-f96a-8e7b-aa7180754aa7","t":"VBCodeProviderWithDocs Class","c":"VBCode Provider With Docs Class This is a custom VB.NET code provider that is able to output an individual XML comments file for each unit that is compiled to a folder of your choice. Definition Namespace:"},{"f":"40ba6bda-95d6-4a64-834f-f7cedcb589d1","t":"Documenting Web Projects","c":"This topic contains the following sections: Documenting Web Application and Web Service Application Projects Documenting Website and Web Service Website Projects Automating the Process Usage Notes and"},{"f":"456d1953-0e81-fedf-4a13-978cfe731ee2","t":"VBCodeProviderWithDocs.CompileAssemblyFromSource Method","c":"VBCode Provider With Docs Compile Assembly From Source Method Compiles an assembly from the specified array of strings containing source code, using the specified compiler settings. Definition Namespace:"},{"f":"60850217-0254-4289-a50d-49af02294eb6","t":"CSharpCodeProviderWithDocs Events","c":"CSharp Code Provider With Docs Events Events Disposed Occurs when the component is disposed by a call to the Dispose method. (Inherited from Component ) See Also Reference CSharpCodeProviderWithDocs Class"},{"f":"60cc1fdb-0886-24de-9a6f-c18a41278f01","t":"CSharpCodeProviderWithDocs(IDictionary\u0026amp;lt;String, String\u0026amp;gt;) Constructor","c":"CSharp Code Provider With Docs(IDictionary String, String ) Constructor This constructor is passed a provider options dictionary Definition Namespace: EWSoftware.CodeDom Assembly: EWSoftware.CodeDom (in"},{"f":"68b376b8-23f2-07b7-d186-bd7fa7a39218","t":"VBCodeProviderWithDocs.CompileAssemblyFromDom Method","c":"VBCode Provider With Docs Compile Assembly From Dom Method Compiles an assembly based on the System.CodeDom trees contained in the specified array of CodeCompileUnit objects, using the specified compiler"},{"f":"6deb9296-45e0-4200-8330-43fdeae88130","t":"Version History","c":"The topics in this section describe the various changes made to the Web Code Providers library over the life of the project. Select a version below to see a description of its changes. Version 2022.3.12.0"},{"f":"750f2c27-4a66-417a-b95a-187410797844","t":"Version 1.1.0.0","c":"Version 1.1.0.0 was released on February 3rd, 2009. Changes in This Release Added constructors to support providerOption elements in the configuration. These are required for .NET 3.5 support. Important"},{"f":"76fcf67f-512e-5391-9221-c4e8582dfa0c","t":"CSharpCodeProviderWithDocs.CompileAssemblyFromSource Method","c":"CSharp Code Provider With Docs Compile Assembly From Source Method Compiles an assembly from the specified array of strings containing source code, using the specified compiler settings. Definition Namespace:"},{"f":"af27da97-4724-a57e-d7d1-76ab081e76f9","t":"VBCodeProviderWithDocs Constructor","c":"VBCode Provider With Docs Constructor There are two overloads for the constructor Overload List VBCodeProviderWithDocs Default constructor VBCodeProviderWithDocs(IDictionary String, String ) This constructor"},{"f":"b694078f-ce50-2ba9-e58b-82d1e41184da","t":"EWSoftware.CodeDom Namespace","c":"EWSoftware. Code Dom Namespace Custom code providers for website projects that can generate XML comments files for all code in the project. Classes CSharpCodeProviderWithDocs This is a custom C# code provider"},{"f":"c27252c1-6d6b-9966-da7d-7e5243251ffa","t":"VBCodeProviderWithDocs Methods","c":"VBCode Provider With Docs Methods Methods CompileAssemblyFromDom Compiles an assembly based on the System.CodeDom trees contained in the specified array of CodeCompileUnit objects, using the specified"},{"f":"c910700e-8f38-0f9a-fdc0-a3f3258a997b","t":"CSharpCodeProviderWithDocs Methods","c":"CSharp Code Provider With Docs Methods Methods CompileAssemblyFromDom Compiles an assembly based on the System.CodeDom trees contained in the specified array of CodeCompileUnit objects, using the specified"},{"f":"cbb7bea7-5a2b-73f1-9c37-f0f603e8ad2a","t":"CSharpCodeProviderWithDocs Class","c":"CSharp Code Provider With Docs Class This is a custom C# code provider that is able to output an individual XML comments file for each unit that is compiled to a folder of your choice. Definition Namespace:"},{"f":"cf91d5b8-d516-e4bd-213c-d683df0e9425","t":"VBCodeProviderWithDocs Constructor","c":"VBCode Provider With Docs Constructor Default constructor Definition Namespace: EWSoftware.CodeDom Assembly: EWSoftware.CodeDom (in EWSoftware.CodeDom.dll) Version: 2022.3.12.0 C# Copy View Source Request"},{"f":"d04920bc-30d3-7244-5c7e-98a6d0716b35","t":"VBCodeProviderWithDocs Events","c":"VBCode Provider With Docs Events Events Disposed Occurs when the component is disposed by a call to the Dispose method. (Inherited from Component ) See Also Reference VBCodeProviderWithDocs Class EWSoftware.CodeDom"},{"f":"e138d987-3509-4019-bd94-9d920110baf5","t":"Version 1.0.0.0","c":"Version 1.0.0.0 was released on May 15th, 2008. Changes in This Release Initial release. See Also Other Resources Version History"},{"f":"ec6dc051-9e56-f325-0255-538308fbe43a","t":"VBCodeProviderWithDocs.CompileAssemblyFromFile Method","c":"VBCode Provider With Docs Compile Assembly From File Method Compiles an assembly from the source code contained in the specified files, using the specified compiler settings. Definition Namespace: EWSoftware.CodeDom"},{"f":"f9c9d2ce-396f-06ae-0d4f-7390ce947bb2","t":"CSharpCodeProviderWithDocs Constructor","c":"CSharp Code Provider With Docs Constructor There are two overloads for the constructor Overload List CSharpCodeProviderWithDocs Default constructor CSharpCodeProviderWithDocs(IDictionary String, String"},{"f":"fff8086e-2d98-05b8-fc43-3da35d81b91b","t":"CSharpCodeProviderWithDocs Properties","c":"CSharp Code Provider With Docs Properties Properties CanRaiseEvents Gets a value indicating whether the component can raise an event. (Inherited from Component ) Container Gets the IContainer that contains"}]